[{"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 5734, "game_title": "Astérix and the Secret Mission", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Getafix the Druid is out of magic potion! If Caesar finds out, it's invasion for sure. Asterix and Obelix set out to find the necessary herbs. A mission through all sorts of Roman-infested terrain - seas and rivers, forests and deserts, temples and ruins.", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 5735, "game_title": "Batman Returns", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Frigid winter winds swept over an already chilled Gotham City. Random street crimes were running at an all-time high, despite the holidays. Down below, in the city's frozen sewers, Oswald Cobblepot, known as The Penguin, planned more mayhem and schemed the take over of the fightened metropolis. His loyal army of missle-packing Penguin Commandos and the bizarre Red Triangle Circus Gang are energized by the evil genius of the web-footed orphan. A desperate call to Batman goes up. Partner with Batman to salvage Gotham City from The Penguin's cold-hearted plot. Guide him in swift, life-like moves from dark alleys to rooftops in vivid scenes based on the hit movie, \"Batman Returns.\" Control his combat style, and help conduct relentless interrogations of The Penguins many allies. Use the Batcave computer to input clues, analyze evidence, and review enemy bios. You're in charge of weapons, too. Stock Batman's Utility belt with enough heat to match the diverse fighting styles of The Penguin and cold-blooded, sewer-dwelling minions. Gotham City is in trouble.", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Al Baker & Associates"], "id": 5736, "game_title": "Disney's Bonkers: Wax Up!", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Creepy Madame Who-Said has lured Bonkers to her spooky Wax Museum where she's turning famous Toons into wax statues! Help Bonkers duck, dodge and sidestep through 6 sticky levels to find his pal Lucky and save the Toons from becoming hot-wax has-beens!", "last_updated": "2018-07-11 21:05:24", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Extended Play Productions"], "id": 5737, "game_title": "Chakan", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Chakan is a fairly standard platform game in which you control a dead guy (Chakan has lost his soul) through many levels of hack and slash platforming. The ultimate goal is defeat all the bad-guys and so finally achieve inner-peace.", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 5738, "game_title": "Columns", "release_date": "1991-04-26", "platform": 20, "players": null, "overview": "Drift back in time to ancient Phoenicia and challenge yourself with Columns, an addictive game played by Middle Eastern merchants centuries ago. In this mesmerizing pastime, tinker with your riches to align glittering jewels across, down, or diagonally.", "last_updated": "2018-07-11 21:05:24", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Disney Interactive"], "id": 5739, "game_title": "The Lucky Dime Caper Starring Donald Duck", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Sorceress Magica De Spell and her rotten ravens have kidnapped Huey, Dewey and Louie! Worse yet, she's snatched Uncle Scrooge's Lucky Dime! Join Donald Duck in his quest to prove that Magica is no match for him.", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sanritsu"], "id": 5740, "game_title": "Fantasy Zone", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Take command of the spaceship Opa-Opa and blast your way through various fantastical levels as you try to take out all the enemy bases in each stage. Once you've destroyed the bases, you'll have to beat the stage boss in order to move on to the next level. By using your guns and bombs wisely, you'll be able to take down your enemies and explore each of the crazy environments in this side-scroller. You can also buy upgraded weapons for your ship by accessing the shop.", "last_updated": "2018-07-11 21:05:24", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SEGA AM-2"], "id": 5741, "game_title": "G-LOC Air Battle", "release_date": "1991-01-01", "platform": 20, "players": 1, "overview": "The enemy has started its attack. They've mobilized their air force and land forces for a major assault. You're stationed on an aircraft carrier on the front line, and it's up to you to show them what an ace pilot can really do!", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Action", "Flight Simulator"], "publishers": ["Sega"], "alternates": ["G-Loc", "G-LOC"]}, {"platform_name": "Sega Game Gear", "developers": ["ITL"], "id": 5742, "game_title": "Halley Wars", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Battle to the death with the legions of evil Lord Halley. The nations of the world have united to create the ultimate fighting machine in an attempt to stop the conquering invader. Use your supreme skills as a star-fighter pilot to blast back the alien destroyers, comets and missiles. Leave no survivors, for anything that gets past you slams into the Earth!", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Millennium Interactive Ltd"], "id": 5743, "game_title": "James Pond II: Codename RoboCod", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "To: James Pond... For your fish eyes only! Pond, the fiendish Dr. Maybe is back. His bombs are ticking in the North Pole toy factories. No human crime fighter has been able to defeat him. So F.I.S.H. (Finned Investigators of Shady Humans) has designed a special Robosuit for your survival on land. Pond, go to it! Remember, Dr. Maybe has a screw loose, so stay on your fins!", "last_updated": "2018-07-11 21:05:24", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["U.S. Gold Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Syrox Developments"], "id": 5744, "game_title": "Disney's The Jungle Book", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Get down to the bare necessities of life... and escort Mowgli through the jungle to the safety of the human village. Fight the boggle-eyed snake, Kaa, and defeat Shere Khan the hungry tiger in this exciting adventure based on Disney's classic! It'll drive you ape crazy!", "last_updated": "2018-07-11 21:05:24", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Virgin Interactive Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 5745, "game_title": "Land of Illusion Starring Mickey Mouse", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Mickey finds himself in a fairy tale land where an evil Phantom-in-the-Clouds has stolen a special gem which brought peace and prosperity to a tiny village. It's up to you to help him save the day - and earn a place in Minnie's heart!", "last_updated": "2018-07-06 22:32:55", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": ["Land of Illusion"]}, {"platform_name": "Sega Game Gear", "developers": ["Syrox Developments"], "id": 5746, "game_title": "The Lion King", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "The game is a side-scrolling platform game, with the controlled character having to leap, climb, run and descend from platform to platform. There is an exception during the level The Stampede, where Simba is running towards (or in the NES and Game Boy versions, running with the camera looking straight down on top of him) the camera dodging wildebeest and leaping over rocks.", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Adventure"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 5747, "game_title": "Vampire: Master of Darkness", "release_date": "1993-11-04", "platform": 20, "players": null, "overview": "You must hunt down Dracula, the Master of Darkness, and defeat him before all of England is in his terrifying grasp! Do you have both the skills and the courage to battle past his ghoulish minions so that you can face this monster and save the day?", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": ["In the Wake of Vampire", "Master of Darkness"]}, {"platform_name": "Sega Game Gear", "developers": ["Namco"], "id": 5749, "game_title": "Ms. Pac-Man", "release_date": "1995-01-01", "platform": 20, "players": 2, "overview": "The gameplay of Ms. Pac-Man is largely identical to that of the original Pac-Man. The player gathers points by eating dots and avoiding ghosts (contact with one loses a life). Power-pellets or energizers change the ghosts, which reverse their course and can be eaten for bonus points. Fruit bonuses can be consumed for increasing point values, twice per level.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Action", "Puzzle"], "publishers": ["Sega"], "alternates": ["Ms. PacMan", "Ms. Pac Man"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 5750, "game_title": "Ninja Gaiden", "release_date": "1991-11-01", "platform": 20, "players": 1, "overview": "The Dragon Ninja village has been massacred! The powerful Dragonsword has been stolen! You are Ryu Hayabusa, last of the Dragon Ninja, and you must find the Dragonsword before it can be used to unleash evil across the Earth!", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 5751, "game_title": "OutRun", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "OutRun is a racing game originating in the arcades. The player can race across varied terrain in a readily available Ferrari, complete with a female passenger, over a series of short tracks.\r\n\r\nGameplay is viewed form just above and behind the car. The roads are full of sharp bends and hazards, contact with which can cause the car to roll and lose the player's time. On each section of track there is a fork in the road, allowing the player to choose which direction he or she wishes to go in. The player has to to complete five track sections in total, out of the fifteen in the game.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Tec Toy Indústria de Brinquedos S.A."], "alternates": ["Out Run", "Outrun", "outrun", "out run"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 5752, "game_title": "Pengo", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Go skating on thin ice! Race Pengo, the lovable penguin, around a frozen lake. Rearrange huge blocks of ice. Your goal: line up three jewel-embedded blocks for dazzling points! Your enemies: SNO-BEES! Their touch puts you in deep freeze.", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 5753, "game_title": "Shinobi", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Shinobi. It's Japanese for stealth, the perfect description of a Master Ninja. And that's exactly what you are! Armed with throwing stars and finely-honed battle skills, you must defeat the Ring of Five. Fight your way past mercenaries and karate thugs. Take out the meanest martial artists and rescue hostages. But these dangers pale in comparison to your ultimate challenge: A fight to the death against five evil Ninja Assassins whose mastery of the deadly ancient arts may well surpass your own!", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": ["The GG Shinobi"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 5754, "game_title": "Sonic the Hedgehog", "release_date": "1991-06-23", "platform": 20, "players": 1, "overview": "It's Super Sonic!!! He's here! It's Sonic The Hedgehog on Game Gear! And he's busting the speed barrier wide open! Blaze by in a blur with his supersonic spin attack. Soar through the tingling rings for super scores. And dash past trouble with Sonic's power-sneakers. Smirk in the face of danger as you sail over glistening hills, scuttle over crumbling bridges and hops rocks in a raging waterfall. Swim through underwater passageways. And plummet down tunnels. Are you ready for life in the fast lane? Then get into gear... with Sonic The Hedgehog on Game Gear! Super pace! Super graphics! And Sonic's super attitude! Soar through BONUS LEVELS brimming with springs, bumpers, flippers, and more. 5 super challenging zones with 3 acts in each zone.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": "-D00HFMfmro", "genres": ["Platform"], "publishers": ["Sega"], "alternates": ["Sonic the hedgehog (jue) (v1.1)"]}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 5755, "game_title": "Sonic the Hedgehog 2", "release_date": "1992-11-17", "platform": 20, "players": 1, "overview": "The world's fastest hedgehog is back, racing through all-new Zones, with more tricks, traps and action than ever before!", "last_updated": "2018-07-11 21:05:24", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Action", "Adventure", "Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 5756, "game_title": "Space Harrier", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Space Harrier is set in the \"Fantasy Zone\", a surreal world composed of bright colors and a checkerboard-styled ground. The enemies are also unique, featuring prehistoric animals, Chinese dragons, and alien pods. The player is forced along the levels, running or flying around enemy fire, while shooting back with fireballs via the character's under-arm cannon (which doubles as a rocket-esque device allowing the character to fly).", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tiertex Design Studios"], "id": 5757, "game_title": "Star Wars", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Your mission: Rescue Princess Leia from Darth Vader's EVIL clutches! Seek help from Obi-Wan Kenobi and Han Solo, but first you must find them. Finally, blast your last, fatal missile and destroy the Dark Side's headquarters... and MAY THE FORCE BE WITH YOU!", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["U.S. Gold Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tiertex Design Studios"], "id": 5758, "game_title": "Super Kick-Off", "release_date": "1991-01-01", "platform": 20, "players": 2, "overview": "Super Kick Off is a football game for the Sega Mega Drive, Sega Master System and Sega Game Gear, released exclusively in Europe and Brazil. It is considered by many to be the watered-down version of Kick Off 2, previously released for the Commodore Amiga (and ported to the Amstrad CPC, Atari ST and Commodore 64). Kick Off 2 was originally programmed by Dino Dini for Anco Games, with the console adaptions being handled by Tiertex.\r\n\r\nFrom a franchise perspective, Super Kick Off would be followed by the controversial Kick Off 3: European Challenge. However, Dino Dini, who had no involvement in Kick Off 3 would go on to form his own company and produce the Amiga/IBM PC game Goal!, which shares similar gameplay. Goal! also arrived on the Mega Drive, in the updated form of Dino Dini's Soccer.", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 5759, "game_title": "Super Monaco GP", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Fry up the track on long straightaways, or downshift into neck-wrenching hairpin curves. Super Monaco GP sends you screaming around the most demanding tracks on earth in the hottest racecar ever built, the Formula 1. Choose your car's transmission. Slide through a practice run with an automatic, battle rival drivers with a 4-speed, or grind gears to victory piloting a 7-speed machine. Burn rubber with the best drivers around in a piston-pounding test of speed, road savvy, and endurance!", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Realtime Associates, Inc."], "id": 5760, "game_title": "Super Star Wars: Return of the Jedi", "release_date": "1994-01-01", "platform": 20, "players": 1, "overview": "Star Wars: Super Return of the Jedi offers a good variety of action for a Game Gear game, with power-ups and continue points located throughout the game. Choosing from five playable characters and two vehicles keeps the game fresh, while simple controls (one for attacking, the other for jumping) make it a game anyone can get into.\r\n\r\nThe graphics look very good for the Game Gear, with solid representations of our favorite characters from the Star Wars saga. Luke looks especially nice, complete with glowing lightsaber. Though the sound is not great, it gets the job done. Unfortunately, the fantastic Star Wars theme music just doesn't sound great.\r\n\r\nThe ability to choose your characters greatly enhances the replay value, and the levels are long enough to keep most gamers busy for quite some time. Some are very difficult and require a lot of patience while performing precise jumping.", "last_updated": "2018-07-11 21:05:24", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Black Pearl Software"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["NuFX"], "id": 5761, "game_title": "Taz-Mania", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Watch TAZ's dust! That spinning superstar with the short fuse and gigantic appetite! TAZ whirls across Tasmania, hunting for the lost giant seabird egg to make the world's largest omelet! TAZ gobbles up everything! Snacks like chilli peppers really burn up his enemies. The hungrier he is, the wilder he gets. Explosive TAZ blasts through multiple levels of high-energy adventure. He rides waterspouts, skids on ice and whizzes through mine shafts in a runaway cart! Villains from the Warner Bros. hit TV series join the mischief, including the Bush Rats, Francis X, Bushlad, Bull Gator and others.", "last_updated": "2018-07-11 21:05:24", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 5762, "game_title": "Wonder Boy", "release_date": "1991-01-01", "platform": 20, "players": 1, "overview": "Your girlfriend...She's gone! Kidnapped by the notorious King Drancon. But this is no ordinary rescue mission. Because King Dracun in no ordinary adversary. Enter the deepest of deep dark forests. And trek across the burning deserts of 10 different lands. Discover supplies that give you speed and strength. Then fend for yourself against nature's nastiest enemies-cobras piranhas bats spiders and finally King Drancon's lightning-speed fireballs.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": ["Revenge of Drancon"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 5763, "game_title": "X-Men: Gamesmaster's Legacy", "release_date": "1995-10-05", "platform": 20, "players": 1, "overview": "A plague AND a deadly double-cross! The Legacy Virus is annihilating mutantkind and the GamesMaster is holding the key. He offers the X-Men a chance to play his game and win the secret...BUT he also offers the same to their arch-enemies with the ADDED satisfaction of destroying the X-Men! The X-Men must split up to find the cure or perish forever.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": ["X-Men 2: Games Master's Legacy"]}, {"platform_name": "Sega Game Gear", "developers": ["Midway"], "id": 11032, "game_title": "NBA Jam Tournament Edition", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "NBA JAM Tournament Edition brings you more senses-shattering slam dunking excitement than ever! More than twice as many NBA superstars, more than double the secret characters, Hot Spots, Super Jam Power-Ups, battery back-up and - OH MY - nine all-new rim-rattling slam dunks plus all the original jams! NBA JAM Tournament Edition... it's on FIRE!", "last_updated": "2018-07-11 21:05:27", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 11145, "game_title": "Sonic Labyrinth", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Dr. Robotnik has created a world of 3D mazes, into which he has thrown Sonic and added a whole new dimension to his life! Now the Dude with Attitude can spin dash in every direction - collecting keys to access hidden levels and bonus rooms as he never could before. Can you help guide Sonic through the maze and past the all-new clan of evil Bosses to defeat the damnable Doctor?", "last_updated": "2018-07-11 21:05:27", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 11146, "game_title": "Tails' Skypatrol", "release_date": "1995-04-28", "platform": 20, "players": 1, "overview": "While flying his plane, Tails discovers a small island and lands to investigate. While initially appearing to be uninhabited, he eventually comes upon an old woman. She declares herself to be the great Wendy Witchcart, and claims the island and everything on it as her own, threatening to transform any dissidents into crystal. She then heads off with her henchmen, and Tails, determined to stop her, chases after them.", "last_updated": "2018-07-11 21:49:00", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": ["テイルスのスカイパトロール"]}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 11147, "game_title": "Tails Adventure", "release_date": "1995-11-17", "platform": 20, "players": 1, "overview": "Tails must stop the Battle Fortress bird army from taking control of Tails Island to rule over the animals.\r\n\r\nOn land, in the air, and at sea, Tails battles some pretty tough birds!", "last_updated": "2018-07-06 22:32:55", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Adventure", "Puzzle", "Platform"], "publishers": ["Sega"], "alternates": ["Tails Adventures"]}, {"platform_name": "Sega Game Gear", "developers": ["Midway"], "id": 11161, "game_title": "NBA Jam", "release_date": "1993-10-20", "platform": 20, "players": 2, "overview": "NBA Jam, which featured 2-on-2 basketball, was one of the first real playable basketball arcade games, and was also one of the first sports games to feature NBA-licensed teams and players, and their real digitized likenesses. A key feature of NBA Jam was the exaggerated nature of the play - players jumped many times above their own height, making slam dunks that defied both human capabilities and the laws of physics. There were no fouls, free throws, or violations except goaltending and 24 second violations. This meant the player was able to freely shove or elbow his opponent out of the way. Additionally, the game had an \"on fire\" feature, where if one player made three baskets in a row, he would become \"on fire\" and have unlimited turbo, no goaltending, and increased shooting ability, until the other team scored (or the player had scored four consecutive baskets while \"on fire\").", "last_updated": "2018-07-11 21:05:27", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Beam Software"], "id": 11827, "game_title": "5 In One FunPak", "release_date": "1994-01-01", "platform": 20, "players": 2, "overview": "5 In One Fun Pak is a Board game, developed by Beam Software and published by Interplay, which was released in 1994.", "last_updated": "2018-07-06 22:32:55", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Interplay Entertainment Corp."], "alternates": ["5 in One: Backgammon Cheekers Chess Reversi Yacht"]}, {"platform_name": "Sega Game Gear", "developers": ["Arc Developments"], "id": 11828, "game_title": "The Addams Family", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "THE ADDAMS FAMILY has been evicted! To save their home from Tully Alford, the family attorney, who is after the family fortune - Morticia, Lurch, Granny, Pugsley and Wednesday have gone to the house to reason with him. But when Gomez arrives, his family is missing! As Gomez, you must save your loved ones, your home and your loads of wealth. Freeing your family will take money, bags and bags of it; but fortunately, you'll find stashes of cash hidden all over the house. You'll have to watch out for scary obstacles like falling spikes, frightening monsters and ghosts. You'll need to look for clues and slove many mysterious puzzles as you search for your family. You may even need someThing to help you - but you'll have to find him first! Get a move on... 'cause you're gonna make a call on THE ADDAMS FAMILY!", "last_updated": "2018-07-11 21:05:27", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Flying Edge, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 11829, "game_title": "Aerial Assault", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "It's the 21st century and N.A.C., a feared terrorist group of the galaxy, threatens to destroy Earth. They've developed the super weapon \"EL\" that will blast away Earth's ozone layer. And they've threatened to use it! As the world's top jet fighter pilot, you're in command of the of the ultimate in combat aircraft - the \"Freedom Fighter.\" Armed with the latest in new high-tech weaponry, you and your jet are Earth's only chance against the merciless N.A.C. Good luck!", "last_updated": "2018-07-11 21:05:27", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 11830, "game_title": "Alien 3", "release_date": "1994-01-01", "platform": 20, "players": 1, "overview": "The ALIENS are fast, spit acid and are right behind you! The motion tracker is your only warning. No time to think, no time to catch your breath... RUN! Can't see very far ahead in these air ducts. Hard to breathe. Face-huggers can be anywhere. You have the firepower... blast the ALIENS with your machine gun, flame thrower and grenade launcher. You know what you have to do... rescue the trapped prisoners and end this nightmare! Just keep telling yourself, \"This isn't really happening. It's only a game!!!\"", "last_updated": "2018-07-11 21:49:30", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Arena Entertainment"], "alternates": ["Alien³"]}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 11831, "game_title": "Alien Syndrome", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "The extra-terrestrials in this game are anything but friendly. They're slimy monsters that are holding space colonists captive aboard seven alien starships. This super action game challenges you to free the helpless hostages. Search each ship's deadly levels, using flamethrowers and laser cannons to vaporize alien scum. Look for maps to help you find your way. After you've saved all the captives from one ship, you must destroy its powerful leader before you can move on to the next ship. Remember, to the aliens, you're slime. And they want you good... and dead!", "last_updated": "2018-07-11 21:05:27", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Spidersoft"], "id": 11832, "game_title": "Andre Agassi Tennis", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Andre Agassi Tennis is a Tennis game, developed by Spidersoft and published by Sega, which was released in 1994.", "last_updated": "2018-07-11 21:05:27", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Al Baker & Associates"], "id": 11833, "game_title": "Arcade Classics", "release_date": "1996-01-01", "platform": 20, "players": null, "overview": "Arcade Classics is a Compilation game, developed by Al Baker and Associates and published by Sega, which was released in 1996.", "last_updated": "2018-07-11 21:05:27", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Arc Developments"], "id": 11834, "game_title": "Arch Rivals", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "The real arcade action between the Arch Rivals is really hot, 'cause tonight there's no fouls! WHAT?! NO FOULS? That's right. No Fouls. This is basketball where breaking the rules is part of the rules! If you can't block a shot - knock your opponent's block off. Arch Rivals also takes real skills like passing, shooting, dribbling, ball handling, slam dunks, and 3 point shots. It's not just basketball... it's basketBRAWL!", "last_updated": "2018-07-11 21:05:27", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Flying Edge, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Eden Entertainment Software"], "id": 11835, "game_title": "Arena: Maze of Death", "release_date": "1996-01-01", "platform": 20, "players": 1, "overview": "An evil government has trapped you in a futurustic labyrinth! Fight your way through urban mazes in pursuit of hidden keys... the keys to expose the government's corruption.", "last_updated": "2018-07-06 22:32:55", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Sega"], "alternates": ["Arena"]}, {"platform_name": "Sega Game Gear", "developers": ["BlueSky Software"], "id": 11836, "game_title": "Disney's Ariel: The Little Mermaid", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Disney's Ariel: The Little Mermaid is an Action game, developed by Blue Sky Software and published by Sega, which was released in 1992.", "last_updated": "2018-07-11 21:05:27", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Core Design Ltd."], "id": 11837, "game_title": "Astérix and the Great Rescue", "release_date": "1994-10-28", "platform": 20, "players": 1, "overview": "Now take the adventures of ancient France with you everywhere! The popular, European character, Asterix and his buddy Obelix set out on a crusade across the Roman Empire to rescue their friends and defeat Caesar.\r\n\r\n-Play either Asterix or Obelix - each with their own wacky powers! Your special powers may prove you very worthy.\r\n\r\n-Clobber the Roman soldiers with fists of fury. Conquer obstacles with magic potions and tricks. Outwit and negotiate through sticky situations!\r\n\r\n-Walk with caution through the Village of Gaul, enter the gates of the Roman fort, and travel the waters of the high seas... journey through 30 levels of Roman adventure!", "last_updated": "2018-07-11 21:05:27", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 11838, "game_title": "Ax Battler: A Legend of Golden Axe", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Use your wits and your razor sharp sword to recapture the Golden Axe from the diabolical Death Adder. Defeat skeletons and giant bats in dark, deep chasms and caves. And summon Earth, Thunder and Fire Magic to fight gargoyles that come to life before your eyes!", "last_updated": "2018-07-11 21:05:27", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 13100, "game_title": "Cheese Cat-Astrophe Starring Speedy Gonzales", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Cheese Cat-Astrophe Starring Speedy Gonzales is a 2D Platformer game, developed and published by Sega, which was released in 1995.", "last_updated": "2018-07-11 21:05:28", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Williams Entertainment"], "id": 13768, "game_title": "Mortal Kombat", "release_date": "1992-10-08", "platform": 20, "players": null, "overview": "Mortal Kombat is a side-scrolling 1 on 1 fighting game. Fighting is set as one on one kombat, allowing each player to perform a variety of punches, kicks, and special moves in order to defeat their opponent. When the opponent faces their second round loss, the winner can perform a finishing move called a \"Fatality\" on the loser. The Fatality is a move unique to each fighter that graphically kills the loser in a blood-soaked finale.", "last_updated": "2018-07-11 21:05:28", "rating": "T - Teen", "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["Williams Electronic Games, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Hookstone Ltd."], "id": 14070, "game_title": "Zoop", "release_date": "1998-11-05", "platform": 20, "players": 1, "overview": "Right here inside this little box is the excitement you crave, the challenge you need. Level after level of brain-burning action coming at you from all sides, faster and faster until your thumbs are numb, your eyes are aching and your mind is molten. And there's only ONE thing you know... \"I can't stop playing this game!\"", "last_updated": "2018-07-11 21:05:28", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Viacom New Media"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Flying Edge"], "id": 14095, "game_title": "George Foreman's KO Boxing", "release_date": "1992-12-01", "platform": 20, "players": 1, "overview": "You're \"Big George\" Foreman and you've got an appetite for BIG action that only KO BOXING can satisfy. Take on a roster of 15 heavyweight contenders as you go for the World Championship. Rook your opponents with stinging left-right combos! Pound your way to the title with a spectacular \"Big George\" Super Punch - while the computer \"judge\" tracks the action! GEORGE FOREMAN'S KO BOXING puts the power of the greatest knockout artist in your hands!", "last_updated": "2018-07-11 21:05:28", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 14105, "game_title": "The Majors Pro Baseball", "release_date": "1992-01-01", "platform": 20, "players": 2, "overview": "The Majors: Pro Baseball is a Sports game, developed and published by Sega, which was released in 1992.", "last_updated": "2018-07-11 21:05:28", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Imagineering Inc."], "id": 14106, "game_title": "The Simpsons: Bart vs. the Space Mutants", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Hello, fellow humans! Barthlomew J. Simpson here, with a very important secret: SPACE MUTANTS ARE INVADING SPRINGFIELD! That's right, man! A buncha slimy, horrible, totally gross and putrid monsters are taking over the bodies of the people who live here and they wanna build a weapon that's gonna take over the entire planet! Anyway, yours truly is the only one who can see 'em 'cause of my X-ray glasses - so it's up to me to stop 'em! I've gotta spraypaint things, get radical on my skateboard, use my trusty slingshot, and in general behave like a nuisance, man. Plus, with evil dudes like Nelson the bully and Sideshow Bob getting in my way, it's a good thing I've got the rest of the Simpsons to help me out! So if you're a decent person, a patriot, and somebody who cares about this sorry planet, you'll do the right thing. Save the Earth!", "last_updated": "2018-07-11 21:05:28", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Flying Edge, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 14794, "game_title": "Bram Stoker's Dracula", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Bram Stoker's Dracula is an Action game, developed by Probe Entertainment Limited and published by Sony Imagesoft, which was released in 1993.", "last_updated": "2018-07-11 21:05:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sony Imagesoft"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 14795, "game_title": "X-Men", "release_date": "1994-01-01", "platform": 20, "players": 1, "overview": "The evil mutant Magneto has devised the world's deadliest computer virus. Its sole purpose: To destroy the Uncanny X-Men. Now Wolverine, Gambit, Cyclops and Nightcrawler join Storm, Iceman, Archangel, Jean Grey and Rogue to stop Magneto from carrying out his diabolical plan. Their target is Magneto's secret base on Asteroid M. But lying in ambush are the murderous arch villains Juggernaut, Sabretooth, Mojo and Deathbird. Will Wolverine's adamantium claws and Gambit's energy-charged playing cards be enough to defeat the forces of Magneto? That's up to you.", "last_updated": "2018-07-11 21:05:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tiertex Design Studios"], "id": 15244, "game_title": "World Cup USA 94", "release_date": "1994-04-05", "platform": 20, "players": 1, "overview": "Realistic gameplay with over 15 different moves. Customise gameplay to suit your own soccer style using pre-match options. Over 3000 frames of animation.", "last_updated": "2018-07-06 22:32:55", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["U.S. Gold Ltd."], "alternates": ["World Cup 94"]}, {"platform_name": "Sega Game Gear", "developers": ["BlueSky Software"], "id": 15712, "game_title": "Joe Montana Football", "release_date": "1991-08-06", "platform": 20, "players": null, "overview": "It's a snap! This is your chance to rub shoulder pads with Joe Montana, the man who led the \"Team of the Eighties\" to four Super Bowl Championships. You provide all the fourth quarter heroics, play-calling brilliance, and pinpoint passing as you hit the field against any of 28 pro teams. Call all your own plays! Each team has a playbook with 17 offensive and six defensive options. Pick the play that you think will work best, or take the advice of Joe Montana himself, as he recommends the play he would call in each situation. You control the action on the field by switching to the key players as the play unfolds. Your strength and speed will vary by position, just like the real sport. Knock helmets with the computer or punch holes in a friend's defense. Can you keep your head cool and your passing arm hot? Pick your team. Choose the plays. Think you have what it takes to be the next Joe Montana?", "last_updated": "2018-07-11 21:05:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["JVM"], "id": 15968, "game_title": "Eternal Legend", "release_date": "1991-08-09", "platform": 20, "players": 1, "overview": "Eternal Legend: Eien no Densetsu (エターナルレジェンド 永遠の伝説?, \"Eternal Legend\")[1] is a Japan-exclusive Game Gear role-playing video game. While the \"Eternal Legend\" name was used in both game packaging and advertising materials, the subtitle \"Eien no Densetsu\" (永遠の伝説) was only used to advertise the game for the Japanese market.", "last_updated": "2018-07-17 03:58:25", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 15969, "game_title": "Crystal Warriors", "release_date": "1991-12-13", "platform": 20, "players": 2, "overview": "The continent of Tyramus has lived in peace for almost a century, thanks to the four elemental crystals of the kingdom of Arliel. However, peace is threatened by the invading armies of the Jyn Empire, led by Emperor Grym, who wants to use the four crystals to rule over Tyramus. Fortunately, Princess Iris can escape with one of the crystals and now the player has to protect her and the crystal and somehow find a way to drive back the hordes of Jyn.\r\n\r\nGameplay in Crystal Warriors is quite similar to Shining Force. The player fights in turn-based battles controlling different characters like fighters, healers, rangers and mages, all with different strengths and skills. Whenever two units engage in battle, they enter a duel mode lasting for up to two turns. In this mode the player can choose between four commands: \"battle\" (attack), \"retreat\", \"spell\" and \"monster\". While the first three commands are quite self-explanatory, the \"monster\" command is interesting. Whenever a non-human enemy is defeated, it can be tamed and be used in battles. While most monsters do not have many HP they can serve as good attackers for physically weak characters or take some hits in order to protect his master. In-between battles the player can visit towns to rest, buy weapons and spells or recruit new party members.", "last_updated": "2018-07-11 21:05:29", "rating": null, "coop": "Yes", "youtube": "7ylN6ASyjeE", "genres": ["Role-Playing", "Strategy"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 15970, "game_title": "Defenders of Oasis", "release_date": "1992-09-18", "platform": 20, "players": null, "overview": "As the Prince, you must defend the world of Oasis from the dark forces in this challenging real-time role-playing game!", "last_updated": "2018-07-11 21:05:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Headgames"], "id": 16976, "game_title": "Taz in Escape from Mars", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "You play as Taz, the famous cartoon-character. Taz is captured by Marvin the Martian and transfered to his intergalactic Zoo! Now it is your job to aid Taz in his great escape from the Zoo-prison and also find a way back home to Earth. To make the escape a little easier, there are items placed here and there, such as cakes which make regain your health. You also find gas tanks, which you can eat and then breath fire.", "last_updated": "2018-07-11 21:05:30", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Interactive Designs"], "id": 17762, "game_title": "Greendog: The Beached Surfer Dude!", "release_date": "1993-08-18", "platform": 20, "players": 1, "overview": "Greendog is one unlucky surfer. He lost his board and got stuck with a cursed necklace. Greendog has to fight his way past a lot of crazed creatures and monsters to find the Aztec treasure or he'll never get rid of the curse!", "last_updated": "2018-07-11 21:05:30", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Psygnosis Limited"], "id": 17773, "game_title": "Lemmings", "release_date": "1993-02-05", "platform": 20, "players": 2, "overview": "The Lemmings are on the move! They walk off cliffs, wander mindlessly into flames and drop like rocks into pools of water. They need you to help them dig, build and blast their way to safety in dozens of levels that go from fun to beyond mayhem!", "last_updated": "2018-07-11 21:05:30", "rating": null, "coop": "No", "youtube": "TikraZvomVA", "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Teeny Weeny Games, Ltd."], "id": 17792, "game_title": "Choplifter III", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Choplifter III is an Action game, developed by Teeny Weeny Games and published by Extreme Entertainment Group, which was released in 1995.", "last_updated": "2018-07-11 21:05:30", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Extreme Entertainment Group"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 17793, "game_title": "Kenyuu Densetsu Yaiba", "release_date": "1994-09-09", "platform": 20, "players": 1, "overview": "Kenyuu Densetsu Yaiba (剣勇伝説YAIBA) is an action game for the Sega Game Gear.", "last_updated": "2018-07-17 03:58:25", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Freestyle Games"], "id": 17794, "game_title": "Mega Man", "release_date": "1995-01-01", "platform": 20, "players": 1, "overview": "Blast-Off with Mega Man For the thrill of your life!\r\n\r\nMega Man must stop Dr. Wily from his no-good sinister plan to destroy civilization. But hold onto those mega-boosters, this job is not going to be easy. Dr. Wily, who is hiding out in his super fortress, has an array of mega-obstacles just waiting for Mega Man. But with your help and a ton of mega-weapons, you have a 50/50 chance of stopping Dr. Wily. So don't whimp-out...get ready for battle in this ressurected saga of the greatest adventures of Mega Man.", "last_updated": "2018-07-11 21:05:30", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["U.S. Gold Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Gremlin Interactive Ltd."], "id": 17795, "game_title": "Monster Truck Wars", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Monster Truck Wars is a Racing game, developed by Gremlin Interactive and published by Acclaim, which was released in 1995.", "last_updated": "2018-07-11 21:05:30", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Al Baker & Associates"], "id": 17796, "game_title": "R.B.I. Baseball '94", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "R.B.I. Baseball '94 is a Sports game, developed by Al Baker and Associates and published by Tengen, which was released in 1994.", "last_updated": "2018-07-11 21:05:30", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Tengen"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 17797, "game_title": "Shinobi II - The Silent Fury", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Shinobi™, the Ninja Master, returns with his team of expert warriors. Wage a bone-wrenching battle against a pack of evil ninjas who threaten the world. Attack with 5 different ninjas. Each has his own special Ninja Magic.\r\nDecimate opponents with swirling Tornado or awesome Earthquake attacks. Outmaneuver enemies with the incredible new Spider Walk. More power, more moves and more Ninja Magic than ever before.", "last_updated": "2018-08-11 15:01:11", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Teque Software Development"], "id": 17798, "game_title": "Wizard Pinball", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Wizard Pinball is an Action game, developed by Teque Interactive and published by Domark, which was released in Europe in 1992.", "last_updated": "2018-07-11 21:05:30", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Domark Group Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 17799, "game_title": "Tempo Jr.", "release_date": "1995-01-11", "platform": 20, "players": 1, "overview": "Music can be fun! Tempo, the hip-hoppin' grasshopper. lives in the musical world of planet Rhythmia. It's up to Tempo to save the rhythm and give King Dirge the blues! Tempo boogies, spins, snaps his fingers and slings notes to zap King Dirge’s tune-swiping ants.\r\n\r\nMusic is the key! Collect CDs to charge up Tempo's energy. Learn about notes in the bonus round!\r\n\r\n5 rockin' stages, each with its own rollin' beat!", "last_updated": "2018-08-11 15:01:11", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 17800, "game_title": "Sonic The Hedgehog - Triple Trouble", "release_date": "1994-11-15", "platform": 20, "players": 1, "overview": "Sonic and Tails are back with three times the fun and three times the trouble! Dr. Robotnik is building the ultimate super-weapon with the help of Knuckles, but you can stop him by getting the Chaos Emeralds first. Rip across snow and water on Sonic's new jet skateboard or zip underwater in Tails' \"Sea Fox\". But look out - Nack the Weasel is after the Emeralds, too!", "last_updated": "2018-07-11 21:52:02", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": ["Sonic & Tails 2"]}, {"platform_name": "Sega Game Gear", "developers": ["Camelot Software Planning"], "id": 19049, "game_title": "Shining Force II: The Sword of Hajya", "release_date": "1994-01-01", "platform": 20, "players": 1, "overview": "The peaceful kingdom of Cypress has suddenly been disrupted by the corrupt ambition of the evil King Iom. Terror rampages across the land. The Castle of Cypress is invaded and the magical Sword of Hajya is taken! It will take strength, courage, agility and your keen sense of strategy to defy this ominous power.", "last_updated": "2018-07-11 21:05:31", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 19050, "game_title": "Shining Force III: Final Conflict", "release_date": "1995-06-30", "platform": 20, "players": 1, "overview": "Shining Force Gaiden: Final Conflict (シャイニング・フォース外伝 FINAL CONFLICT) is an RPG for the Sega Game Gear. It was only released in Japan.", "last_updated": "2018-07-17 03:58:26", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Shimada Kikaku"], "id": 19051, "game_title": "Bishoujo Senshi Sailor Moon S", "release_date": "1995-01-27", "platform": 20, "players": 1, "overview": "Sailor Moon and the senshi are up against a new set of villains: the Death Busters (Professor Tomoe, Kaorinite, the Witches 5, Mistress 9, Pharaoh 90). The Death Busters plan to rule the world by using the energy from the pure heart crystals of innocent victims, but Sailor Moon and the senshi must stop them.", "last_updated": "2018-07-11 21:05:31", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Bandai Co., Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 19062, "game_title": "Sonic Drift 2", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Start your engines and prepare for the race of your life! Choose from 7 of your favorite characters including Sonic, Knuckles and Robotnik, each with his own special powers. Plug in your Gear to Gear connector and take on a friend through over 17 courses in the ultimate Chaos Grand Prix!", "last_updated": "2018-07-11 21:05:31", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 19235, "game_title": "Kishin Douji Zenki", "release_date": "1995-09-01", "platform": 20, "players": 1, "overview": "Enno Ozuno, Master of the Enno temple used the demon guardian spirit Zenki to defeat the demon goddess Karuma. After defeating Karuma, he later sealed Zenki away in a pillar until needed again.\r\n\r\nCenturies later, his descendant, a school girl named Chiaki Enno is able to free Zenki, although the demon currently has the form of a brattish demon child. To transform this extremely defiant demon into the form that made him useful by her ancestor, she uses a bracelet that appeared on her wrist when servants of Karuma broke the seal that imprisoned a seed of Karuma. Zenki appears because the seeds of Karuma start appearing and turning people into monsters and Zenki needed again to eradicate this menace", "last_updated": "2018-07-11 21:53:11", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": ["鬼神童子ＺＥＮＫＩ"]}, {"platform_name": "Sega Game Gear", "developers": ["Minato Giken"], "id": 19236, "game_title": "Yu Yu Hakusho: Horobishi Mono no Gyakushuu", "release_date": "1994-03-18", "platform": 20, "players": 1, "overview": "Yu Yu Hakusho: Horobishi Mono no Gyakushuu (幽遊白書 － 滅びし者の逆襲) is an action game for the Sega Game Gear. It is based upon the YuYu Hakusho manga and anime series.", "last_updated": "2018-07-17 03:58:26", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Telenet Japan"], "id": 19237, "game_title": "Griffin", "release_date": "1991-07-26", "platform": 20, "players": 1, "overview": "Griffin (グリフォン) is a shoot-'em-up game developed by Telenet Japan's \"Renovation Game\" division (which is not the same as Renovation Products) and published by Telenet Japan's RIOT division for the Sega Game Gear. It was only released in Japan.", "last_updated": "2018-07-17 03:58:26", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Riot"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 19419, "game_title": "Sonic The Hedgehog Chaos", "release_date": "1993-11-23", "platform": 20, "players": 1, "overview": "The storyline to Sonic Chaos, like most Sonic stories, revolves around Dr. Robotnik and his quest for world domination via the mythical Chaos Emeralds. The Emeralds are the source of vitality for all living things, but they could be turned into nuclear bombs and laser weapons in the hands of the rotten Dr. Robotnik.\r\n\r\nDr. Robotnik has stolen the Red Chaos Emerald, causing the other five to \"lose balance\" and scatter themselves into a parallel universe. As a result of the instability, South Island is now sinking into the ocean. It is up to Sonic and Tails to find the Chaos Emeralds and restore harmony to the universe, or else the innocent residents of South Island will find themselves taking a long swim.", "last_updated": "2018-07-11 21:05:31", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Imagineering Inc."], "id": 19836, "game_title": "The Simpsons: Bart vs. the World", "release_date": "1993-01-01", "platform": 20, "players": 1, "overview": "The game is based on the animated television series The Simpsons.[1] On the Krusty the Clown Show, Bart Simpson wins the opportunity to participate in a Round-the-World scavenger hunt. However, the contest has been rigged by Mr. Burns' assistant, Smithers, in order for Burns to rid himself of the Simpson family for all the trouble they have caused him over the years. Burns sends his agents and fellow family members to take care of the Simpsons during the scavenger hunt. Bart travels through various real-world locations collecting items, with occasional cameos from the other Simpsons family members.[2][3]", "last_updated": "2018-07-11 21:05:31", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Adventure", "Platform"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aisystem Tokyo", "Opera House"], "id": 19837, "game_title": "Devilish", "release_date": "1991-04-29", "platform": 20, "players": 1, "overview": "A prince and princess were in love with each other until a jealous demon turned the happy couple into a set of stone paddles; resembling that of the pinball kind.Suddenly, a ball came into existence that could use the prince and princess in order to defeat the demons that now rule over the kingdom. Players have to use two paddles; the upper one is used to defeat demons while the lower one helps to prevent the player from dropping to its demise at the bottom of the board. By defeating bad guys and smashing through breakable blocks, the player advances towards the boss of each level.\r\nResembling a harder version of Arkanoid, the vertically scrolling screen forces the ball to move constantly forward in an attempt to reach the boss.\r\nOnly the Sega Mega Drive version has a two-player option. Players can choose between three difficulty levels in the Game Gear version and can also select an option to do a time trial.", "last_updated": "2018-07-11 21:05:31", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Electronic Arts"], "id": 19992, "game_title": "Road Rash", "release_date": "1991-01-01", "platform": 20, "players": 1, "overview": "Road Rash is the name of a motorcycle-racing video game series by Electronic Arts in which the player participates in violent, illegal street races. The series started on the Mega Drive and made its way to various other systems over the years. The game's title is based on the slang term for the severe friction burns that can occur in a motorcycle fall where skin comes into contact with the ground at high speed.\r\n\r\nIn an attempt to improve on the basic Hang-On concept, where the player's vehicle remains on the same horizontal plane and turns are essentially a matter of moving left or right, Road Rash requires that players contend with various grade changes. The physics reflect the act of going up or down a hill, as well as turning while climbing; this results in the ability to launch one's motorcycle great distances, resulting in crashes (and their animations). Aside from this, Road Rash has a standard system of obstacles including street signs, trees, poles, and livestock; and taking from OutRun, active traffic while racing against other bikers.\r\n\r\nWhat Road Rash really brings to the table is \"brawling\"; the player can fight other bikers with a variety of hand weapons or simple punches and kicks. The player initially starts off with just those basics, but can grab a weapon from another rider by timing a punch correctly. The list of weapons has grown with the games, starting from the clubs in the first Road Rash, and eventually including things like crowbars, nunchaku, and cattle prods. Whatever the weapon, successful attacks damage an opponent's stamina, and depleting this stamina will cause a biker to wipeout which can also damage the bike; this functions much like hitting a car or other major obstacle, and it all applies to you as much as to other racers (though in most of the games, you have more stamina than opponents).\r\n\r\nAs mentioned before, the last and most major obstacle are cops. The motorcycle police officers fight the player as another opponent and serve as gameplay enforcers by culling players who fall too far behind or choose to explore the world rather than race in it. Losing a fight with an officer or being caught by one while off one's motorcycle causes the player to be Busted, ending the race.", "last_updated": "2018-07-11 21:05:31", "rating": null, "coop": "No", "youtube": null, "genres": ["Action", "Racing"], "publishers": ["Electronic Arts"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 19993, "game_title": "The Ottifants", "release_date": "1993-01-01", "platform": 20, "players": 1, "overview": "The Ottifants is a 2D platformer released for the Sega Genesis, Master System and Game Gear in 1993. It was only released in Europe and Brasil. The Ottifant is a creation of German comedian and actor Otto Waalkes. The name is a portmanteau of Waalkes' nickname Otti and the German word for elephant.\r\n\r\nGame description:\r\n\r\n \"All is not well for Bruno, the baby Ottifant. A father captured by Aliens! Or so our Otti-infant imagines as he follows the trail of sweets that will lead him to his abducted parent. It's a trail of peril and adventure--- terrifying toys, a blood-chilling basement and an office of hi-tech horror.\"", "last_updated": "2018-07-11 21:05:31", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 20252, "game_title": "Mortal Kombat II", "release_date": "1994-09-09", "platform": 20, "players": 2, "overview": "NOTHING, NOTHING CAN PREPARE YOU! All the fierce kombatants of the #1 arcade smash gather for Mortal Kombat II, a battle to defeat the shape-shifting demon Shang Tsung and his ruthless master, Shao Kahn. Brutal special moves, Friendships, Babalities, hidden surprises, crushing combos and outrageous finishing moves - ALL yours to kommand. Let the Kombat kontinue...", "last_updated": "2018-07-11 21:05:31", "rating": "M - Mature", "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Studio Alex"], "id": 20260, "game_title": "Lunar: Sanposuru Gakuen", "release_date": "1996-01-12", "platform": 20, "players": 1, "overview": "This is a side-story, set in the same world as the famous Lunar RPGs: Silver Star and Eternal Blue. The town of Burg is populated by harvesters, and you take control of two girls, Ellie and Lena. One day, they are sent to the island of Ien where they should study magic, and there begins their adventure.\r\n\r\nThe game is a traditional Japanese-style RPG. You navigate your party through a top-down world, visiting towns and hostile areas. Enemy encounters are random, the battles are turn-based and are viewed from first-person perspective.\r\n\r\nWhilst not officially released in English, there is now a completed fan-translation of this game.", "last_updated": "2018-07-11 21:05:31", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Game Arts Co., Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 20353, "game_title": "Disney's Aladdin", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Aladdin (アラジン) is a platform game developed by Sims on Game Gear, Nexa on Master System, and published by Sega and TecToy in 1994. It is based on Disney's movie of the same name . An entirely different game of the same name was developed for the Sega Mega Drive by Virgin Interactive.", "last_updated": "2018-07-17 03:58:27", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Action", "Adventure", "Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Novotrade International"], "id": 20543, "game_title": "Adventures of Batman & Robin", "release_date": "1995-05-26", "platform": 20, "players": 1, "overview": "Break out your Batarang! When the scum of Gotham City decide they want to take over, it's no joke... Or is it? The Joker and his cohorts kidnap Robin as the perfect bait to lure Batman. You can bet that the Dark Knight is going to be up to his ears\r\nin hard-hitting combat before this episode is over!", "last_updated": "2018-07-11 21:05:31", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 20544, "game_title": "Ayrton Senna's Super Monaco GP II", "release_date": "1992-01-01", "platform": 20, "players": 1, "overview": "Ayrton Senna's Super Monaco GP II (アイルトン・セナ スーパーモナコＧＰ II) or simply Super Monaco GP II is a racing game developed and published by Sega for the Sega Mega Drive, Sega Master System and Sega Game Gear in 1992. It is a sequel to Super Monaco GP, but this time the game is sponsored by Ayrton Senna (who won the Monaco Grand Prix six times). Also unlike the previous game, Super Monaco GP II was not released in arcades or for any non-Sega console or computer.\r\n\r\nAt the time of release it was regarded as the most realistic racing experience on home video game consoles, and the fact that it was endorsed by Ayrton Senna meant the game was very popular. However, due to these celebrity endorsements, it is unlikely Super Monaco GP II will be re-released without cutbacks.", "last_updated": "2018-07-17 03:58:28", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Wolf Team"], "id": 20545, "game_title": "Zan Gear", "release_date": "1990-10-27", "platform": 20, "players": 1, "overview": "Zan Gear (斬ギア) is a simulation game for the Sega Game Gear.", "last_updated": "2018-07-17 03:58:28", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Wolf Team"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Minato Giken"], "id": 20546, "game_title": "Yu Yu Hakusho 2: Gekitou! Nanakyou no Tatakai", "release_date": "1994-09-30", "platform": 20, "players": 2, "overview": "Yu Yu Hakusho II: Gekitou! Nanakyou no Tatakai (幽遊白書ＩＩ － 激闘！七強の戦い) is an action game for the Sega Game Gear. It is based upon the YuYu Hakusho manga and anime series.", "last_updated": "2018-07-17 03:58:28", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Virgin Interactive Entertainment"], "id": 21260, "game_title": "Cool Spot", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Charge, blast and hurdle through this fun and frantic adventure without losing your cool - or your shades! As COOL SPOT, you'll stop at nothing to rescue your SPOT buddies when they get snatched by powers uncool! Shoot the curl, get loco on a runaway train, and whip through a stomach-dropping rollercoaster ride in a carbonated quest to chill out your foes! Graphics so hot - you'll need your own shades!", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Virgin Interactive Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sculptured Software"], "id": 21288, "game_title": "Mortal Kombat 3", "release_date": "1996-01-01", "platform": 20, "players": null, "overview": "Grab the third tidal wave of karnage and mystery! Shao Kahn has seized absolute control of earth and the Outworld. Now both are plunged into oblivion, overrun by Shao Kahn's savage kreatures. You must klash with evil to pierce the darkness.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Domark Software"], "id": 21317, "game_title": "Formula One", "release_date": "1993-01-01", "platform": 20, "players": 1, "overview": "In Formula One, your car could reach a blistering 200mph - and it's speed you can feel. And if that's not fast enough for your lead foot, check out our Turbo Mode - kick in the afterburners and scream past the grandstands at a cool 220! Only Formula One by Domark can give you that rush. Strap on your helmet and buckle-up 'cause you're gonna race against the real pros of Formula One World Championship - on 12 international circuits including England's super-fast Silverstone raceway and the world famous Monaco track at Monte Carlo.", "last_updated": "2018-07-06 22:32:55", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Domark Group Ltd."], "alternates": ["Formula 1", "F1"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 21318, "game_title": "Jurassic Park", "release_date": "1993-10-01", "platform": 20, "players": 1, "overview": "One of many games based on the 1993 blockbuster Jurassic Park, the version for Sega's 8-bit systems combines side-scrolling shooting action and platforming levels.\r\n\r\nIn each of the five stages of the game, one escaped dinosaur species must be recaptured. Each level begins with a side-scrolling driving section. Dinosaurs attack the car and must be fend off by firing at them with a crosshair. If the player survives long enough, a boss battle against an especially powerful dinosaur follows.\r\n\r\nAfter the completion of the driving section the level continues with a platform section. The player must jump, duck and climb to survive moving lifts, floors that will crumble under his feet, environmental hazards like acid drops, steam leaks or giant boulders and more. Dinosaurs will of course also stand in the way, but can be defeated by using several weapons: a rifle, a grenade launcher and hand grenades. Navigating the often maze-like levels will lead to the dinosaur that must be captured and a corresponding boss fight.\r\n\r\nThe first four levels (featuring a Velociraptor, Pteranodon, Triceratops and Brachiosaurus) can be tackled in any order, but the final level, featuring the Tyrannosaurus Rex, is only unlocked when the others have been completed.", "last_updated": "2018-07-11 21:05:32", "rating": "T - Teen", "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Teque London"], "id": 21319, "game_title": "Kawasaki Superbike Challenge", "release_date": "1994-01-01", "platform": 20, "players": 2, "overview": "Join the legendary Kawasaki \"Team Green\" racing around the most exhilarating circuits in the world on the ZXR750R in the World 750cc Superbikes Championship. Developed in close association with Kawasaki to ensure total accuracy and realism, Kawasaki Superbikes is the motorboke racing game to leave all others standing.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Domark Group Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 21320, "game_title": "Legend of Illusion Starring Mickey Mouse", "release_date": "1995-01-01", "platform": 20, "players": 1, "overview": "Mickey is tricked into a perilous quest when the kingdom is threatened by an evil cloud of darkness. As temporary king, Mickey must solve riddles, find maps and avoid trickery across 5 magical lands to save the Tree of Life from the cowardly King Pete.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 21321, "game_title": "The Lost World: Jurassic Park", "release_date": "1997-01-01", "platform": 20, "players": null, "overview": "The Lost World: Jurassic Park developed by Aspect Co. and published by Sega, was also the final game released in North America and Europe for the Sega Game Gear, released in August 1997.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 21344, "game_title": "Castle of Illusion Starring Mickey Mouse", "release_date": "1991-04-26", "platform": 20, "players": null, "overview": "Minnie Mouse has been kidnapped by the evil witch Mizrabel, and it's up to Mickey Mouse to venture through the mysterious worlds of the Castle of Illusion to rescue her in this 2D platformer (and collaboration between Disney and Sega).", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 21345, "game_title": "Deep Duck Trouble Starring Donald Duck", "release_date": "1993-12-17", "platform": 20, "players": null, "overview": "Uncle Scrooge found a magical necklace on a mysterious island, but the necklace put a curse on him. Now Uncle Scrooge is doomed to float around in the air forever! (Of course Donald always said Scrooge was full of hot air anyway!) To take the curse off Uncle Scrooge, Donald has to take the necklace back to the island. But there's plenty of danger awaiting Donald there. How about lending him a hand?", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 21346, "game_title": "Dragon Crystal", "release_date": "1990-01-01", "platform": 20, "players": null, "overview": "You're caught in a fantastic world of unearthly beauty and deadly demons. You'll pass through thirty worlds in search of the Magic Goblet. There's no way out of this musical nightmare...until you find it.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Realtime Associates, Inc."], "id": 21759, "game_title": "The Berenstain Bears: Camping Adventure", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "The Berenstain Bears: Camping Adventure is an Action game, developed by Realtime Associates and published by Sega, which was released in 1994.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Taito Corporation"], "id": 21760, "game_title": "Bubble Bobble", "release_date": "1994-01-01", "platform": 20, "players": 2, "overview": "THESE ARE TWO HUNGRY DINO-MIGHTS AND THEY'VE GOT BUBBLE FIGHT'N FUN DOWN TIGHT. You and your two brontosaurus buddies, Bub and Bob, are up to your brows in bubble troubles. You've got to battle battalions of bullies by blowing and bursting billions of bubbles. It's a fast-paced bubble banquet through dozens of screens of slap happy suds. Got an appetite for fun... then get blowin'.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 21761, "game_title": "Fatal Fury Special", "release_date": "1993-09-16", "platform": 20, "players": 2, "overview": "Fatal Fury Special (餓狼伝説SPECIAL Garō Densetsu Special, \"Legend of the Hungry Wolf Special\") is a 1993 head-to-head fighting game produced by SNK originally released for the Neo Geo arcade and home platforms. It is an updated version of Fatal Fury 2, introducing several changes to the gameplay system while expanding the available character roster.", "last_updated": "2018-07-17 03:58:28", "rating": null, "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["TAKARA Co., Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Software Creations"], "id": 21762, "game_title": "Foreman for Real", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Foreman For Real is a Sports game, developed by Software Creations and published by Acclaim Japan, which was released in 1995.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Realtime Associates, Inc."], "id": 21763, "game_title": "Frank Thomas Big Hurt Baseball", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Frank wanted big league technology to match his two-time MVP award-winning style. He wanted authentic gameplay like pitchers losing arm strength. He wanted CD-quality sound FX including umpire calls, crowd cheering and bat cracking. He wanted 8 pitch selections and 27 stat categories. He wanted 6 modes of play including Season, All-Star Game, Home Run Derby, Playoffs, and Batting Practice. He wanted 28 3D rendered stadiums to crank home runs. He wanted motion captured sprites. And he wanted a ton of camera angles to check out all the action... he got it!", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Teque Software Development"], "id": 21764, "game_title": "Gear Works", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Gear Works is an Action game, developed by Teque Interactive and published by Sony Imagesoft, which was released in 1994.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sony Imagesoft"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 21765, "game_title": "Batman Forever", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "The Real Game Begins! BATMAN FOREVER! Brace yourself for endless action with BATMAN FOREVER! BATMAN and ROBIN blast into GOTHAM CITY in a duo-player fighting game! Armed with tons of incredible attacks, fierce combat moves, and an arsenal of gadgets, the DYNAMIC DUO are ready to battle the diabolical minds of TWO-FACE and THE RIDDLER! Without question... it's BATMAN FOREVER!", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 21766, "game_title": "Bugs Bunny in Double Trouble", "release_date": "1996-01-01", "platform": 20, "players": null, "overview": "BUGS BUNNY has dreamed his way into double trouble. A Mad Scientist is after Bugs' brain! To escape, bugs must use the Scientist's Televisor to travel through dreamland and outwit his LOONEY TUNES pals, including DAFFY DUCK, ELMER FUDD, and YOSEMITE SAM. But Bugs' nightmare doesn't end there. Before he can rest, Bugs must rocket to Mars to battle MARVIN THE MARTIAN and his trusty dog K-9. Move fast or... \"That's all Folks!\"", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 21767, "game_title": "Daffy Duck in Hollywood", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Presenting the world famous Daffy Duck P.I. Armed with your lethal bubble gun, search the Hollywood film sets for Yosemite Sam's Golden Cartoon World Movie Awards and the despicable Mad Professor Duck Brain.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 21768, "game_title": "Desert Speedtrap", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Desert Speedtrap starring Road Runner & Wile E. Coyote is an Action game, developed by Probe Entertainment Limited and published by Sega, which was released in 1994.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Electronic Arts"], "id": 21769, "game_title": "Desert Strike: Return to the Gulf", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "The Scuds are back! With a fiery blast from your Hellfire missiles you must annihilate a ruthless tyrant's military arsenal. Smoke his private yacht and tear into his air force as you challenge the Madman's forces in a series of surgical strikes. Rip through lots of fiery missions. Force is highly recommended.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Domark Group Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Virgin Interactive Entertainment"], "id": 21770, "game_title": "Double Dragon", "release_date": "1993-03-26", "platform": 20, "players": 1, "overview": "MESS WITH THE BEST DIE LIKE THE REST\r\n\r\nThat's the motto of the Dragon lords - the meanest. roughest street gang around. Brothers Billy and Jimmy lee Just found out the hard way that getting out of this gang is even tougher than getting in. Only one got out with his life. From sweeping side kicks to the dirtiest street fighting imaginable, you'll be up to your neck in martial arts action as you take on the role of Billy to avenge your brother's death.\r\n\r\nToo bad for the Dragon Lords they taught you everything you know. Now it's time to show them they picked the wrong brother to mess with!", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["Virgin Interactive Entertainment, Inc."], "alternates": ["Double Dragon: The Revenge of Billy Lee"]}, {"platform_name": "Sega Game Gear", "developers": ["Virgin Interactive Entertainment"], "id": 21771, "game_title": "Dragon: The Bruce Lee Story", "release_date": "1993-08-20", "platform": 20, "players": 1, "overview": "Enter the world of Dragon. A place where the martial arts legend Bruce Lee lived for 32 troublesome years. A place where you will encounter a multitude of the smartest and fiercest opponents ever to be seen in a GameGear beat-'em-up! At your disposal is a devastating array of fighting moves. You WILL need them...", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Codemasters"], "id": 21772, "game_title": "Dropzone", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Dropzone is an Action game, developed and published by Codemasters, which was released in Europe in 1994.", "last_updated": "2018-07-11 21:05:32", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Codemasters"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 22365, "game_title": "World Series Baseball", "release_date": "1993-01-01", "platform": 20, "players": 1, "overview": "Step up to the plate with the premiere video game in baseball: World Series Baseball. Saturn technology delivers unbelievable color, 3D graphics and ultra-smooth perspective tracking. Enjoy incredible detail from 5 different ballpark perspectives. Swing for the fences at Fenway or another one of the game's ultra-realistic major league ballparks. Choose among play modes including 162-game pennant race, All-Star and Play-Off modes as well as a power hitter duel in Home Run Derby. Play as any one of the 28 major league teams, complete with high resolution player photos.", "last_updated": "2018-07-11 21:05:32", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 22366, "game_title": "Sonic the Hedgehog Spinball", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Sonic The Hedgehog spins into pinball pandemonium! Dr. Robotnik's latest robotic-creation factory is the Veg-O-Fortress, a volcanic island fueled by the Chaos Emeralds and protected by the Pinball Defense System. Strap on your Power Sneakers for all-new Sonic moves! Sonic rockets into space, spring launches from levers and balls up for a high-altitude bounce! Multi-round zones of wild Sonic action through glittering caverns, oozing toxic pools and boiling lava pits!", "last_updated": "2018-07-06 22:32:55", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": ["Sonic Spinball"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 23379, "game_title": "Sylvan Tale", "release_date": "1995-01-27", "platform": 20, "players": null, "overview": "Sylvan Tale follows the typical action-adventure game formula: The player controls a character who must solve puzzles, fight enemies, and talk to non-player characters in order to acquire special powers and items that will allow him to unlock new areas of the game world and solve the puzzles within. While the player may revisit areas, the game progresses in an essentially linear fashion, as each area can only be accessed if Zetts(the player character) has acquired a specific item or ability from the previous area.", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": null, "genres": ["Action", "Adventure"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Arc System Works Co., Ltd."], "id": 24001, "game_title": "Battletoads", "release_date": "1993-05-06", "platform": 20, "players": 1, "overview": "When the evil Dark Queen kidnaps both your best buddy and the best-looking girl this side of the Mazallion Star Cluster\r\nwhat are you gonna do about it? Are you gonna cry? Hide? Call the Starcops? No way! Because you're a BATTLETOAD and BATTLETOADS don't cry. hide. or call for help. BATTLETOADS get real MAD - and then they get EVEN!\r\n\r\nSo, strap on your Blaster, power-up the 'Toadster, and get on down to the Dark Queen's planet - but, watch out 'toad - this lady's bad. and she's got a whole mess of really nasty surprises lined up for you like the Psyko Pigs, the Mutant Flatpack. Robo-Manus and the Saturn ’Toadtrap, to name but a few. You're gonna need all your fighting skills to defeat her the Battletoad Butt. the Big Bad Boot and the Nuclear Knuckles. Hey. and don't forget to take along the Jet Turbo, the Space Board and the Speed Bike. Because you're gonna need 'em all. ‘toad. if you're gonna rescue your friends and get the frog outta ther with your green skin intact!", "last_updated": "2018-07-17 03:58:28", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Tradewest, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Acme Interactive"], "id": 24159, "game_title": "Evander Holyfield's 'Real Deal' Boxing", "release_date": "1992-10-29", "platform": 20, "players": 2, "overview": "Evander 'Real Deal' Holyfield's Boxing is a Sports game, developed by Novotrade and published by Sega, which was released in 1992.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Fighting", "Sports"], "publishers": ["Sega"], "alternates": ["Evander Holyfield's Boxing"]}, {"platform_name": "Sega Game Gear", "developers": ["Minato Giken"], "id": 24268, "game_title": "Baku Baku", "release_date": "1996-01-26", "platform": 20, "players": 1, "overview": "You're the zookeeper in a crazy kingdom. But you'd better watch out - once you dive into the Baku Baku den, there's no turning back... To win, match each animal with its favorite food. Challenge computer characters or go head-to-head in 2-player mode. Beautiful 3D graphics and stunning colors bring puzzling to the next level. Variable game speed lets you go slow-mo or full throttle. Better be clever - surprises await true Baku masters...", "last_updated": "2018-07-06 22:32:55", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": ["Baku Baku Animal"]}, {"platform_name": "Sega Game Gear", "developers": ["Teeny Weeny Games, Ltd."], "id": 24269, "game_title": "The Simpsons: Bartman Meets Radioactive Man", "release_date": "1992-12-01", "platform": 20, "players": 1, "overview": "Players control Bartman through 2D side-scrolling platform levels. He needs to defeat enemies, collect goodies, and be careful not to fall into one of the deadly traps on his way. Bartman can punch and kick, and collect lightning icons to shoot small bolts. Most of the level sequences require precise timing and pixel-perfect jumping precision. Bartman has five life points that are restored by collecting radioactive signs.", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": null, "genres": ["Action", "Platform"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Namco"], "id": 24270, "game_title": "Batter Up", "release_date": "1991-04-05", "platform": 20, "players": 2, "overview": "Batter Up is a Sports game, developed and published by Namco, which was released in Japan in 1991.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Namco"], "alternates": ["Gear Stadium"]}, {"platform_name": "Sega Game Gear", "developers": ["NGM Productions"], "id": 24271, "game_title": "Battleship", "release_date": "1993-01-01", "platform": 20, "players": 1, "overview": "Do you have what it takes to command your own fleet of six ships?  Can you survive thrilling, ruthless combat on the high seas?  Stalk your enemy through unfriendly waters. Secretly plot your plan of attack.  Then fire.  It's a hit!  But remain on red alert!  For your opponent wants victory as much as you do!  Capsize a carrier.  Demolish a destroyer.  Sink up to six ships in your opponent's fleet before your own vessels are found and sunk.  Blast the torpedoes and full speed ahead!", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": "6hGD7S_yVU4", "genres": ["Strategy"], "publishers": ["Mindscape, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["NuFX"], "id": 24272, "game_title": "Beavis and Butt-head", "release_date": "1994-01-01", "platform": 20, "players": 1, "overview": "We were gonna go to this GWAR concert. Then Anderson's stupid dog, like, chewed up the tickets. Now you gotta help us find the pieces or somebody's gonna pay for it. Probably Beavis. Van Driessen tried to teach us, like, history. But we outsmarted him. Couch fishing rules. Unless there's something good on TV or something. Would you like flies to go with that mouseburger? Heh heh heh heh. At the Turbo Mall, you can meet wild creatures and stuff. Like us.", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": null, "genres": ["Adventure"], "publishers": ["Viacom New Media"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Santos"], "id": 24273, "game_title": "Bust-A-Move", "release_date": "1995-01-01", "platform": 20, "players": 1, "overview": "Which will burst first: your concentration or the level you're working on? It takes more than just swinging the bubble-turret and taking aim on the falling ceiling; tactical planning and mental dexterity are the only way to string together three or more bubbles and 100 wins to make it through all the bubble and ego-bursting rounds of Bust-A-Move!", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Taito Corporation"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Teeny Weeny Games, Ltd."], "id": 24274, "game_title": "Caesars Palace", "release_date": "1993-01-01", "platform": 20, "players": 1, "overview": "Caesars Palace stretches your entertainment dollar to the hilt with more casino gaming action than ever before available for GameGear! With lots of games to choose from, you'll experience the pulse-quickening excitement of casino gaming in the world famous Caesars Palace. Special invitation-only VIP tables: Make the big bucks and you may be invited to play with the big boys. One-stop shopping at the ATM machines: Withdraw money, keep track of your winnings and play a scratcher at any of the ATMs scattered throughout the casino.", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Virgin Interactive Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Realtime Associates, Inc."], "id": 24275, "game_title": "Captain America and the Avengers", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Red Skull is back with a sinister mind-control device to command the most evil supervillains on earth against the forces of good. The supervillains want to control the universe! Captain America and the Avengers are the world's last hope in this battle against evil Join Cap, Iron Man, Hawkeye and Vision, as they combine their special powers with your skills in a last ditch effort to defeat Red Skill and his evil henchmen. Succeed, and you're a hero. Fail, and we'll revoke your Avengers security clearance!", "last_updated": "2018-07-11 21:05:33", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Action", "Adventure"], "publishers": ["Mindscape, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Beam Software"], "id": 24276, "game_title": "Casino FunPak", "release_date": "1995-01-01", "platform": 20, "players": 1, "overview": "Casino FunPak is a Miscellaneous game, developed by Beam Software and published by Interplay, which was released in 1995.", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Interplay Entertainment Corp."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["NovaLogic, Inc."], "id": 24277, "game_title": "The Chessmaster", "release_date": "1992-01-01", "platform": 20, "players": 2, "overview": "Introducing... The Chessmaster, the most powerful chess program in the world today - and the friendliest! With lots of different features, The Chessmaster is the perfect chess companion, adversary and instructor for any chess player, beginner or expert. Watch The Chessmaster think, force The Chessmaster to move, change sides at any time... you can play, practice or learn chess on the go! Many challenging levels from Newcomer to Grandmaster. Teaching mode shows all possible legal moves. Set up pieces in any position to play and solve chess problems.", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 24278, "game_title": "Chicago Syndicate", "release_date": "1995-07-07", "platform": 20, "players": 1, "overview": "Chicago 1920: Corruption and violence have taken hold of the city. Six gangster bosses control the streets. Larcen Tyler must singlehandedly take control of Chicago, or die trying!\r\n\r\n-Presenting Larcen Tyler, from Eternal Champions, in his best role ever - from expert gangster to clean-up crusader!\r\n\r\n-Use Larcen's full range of weapons, and 60 different fighting moves to fight Chicago's toughest gangsters in six territories of the city!\r\n\r\n-Your attack plan depends on what's currently happening in each territory. Stay on top of the syndicates next moves through informants and local events to plan your attack strategically!\r\n\r\nNo game will ever be the same!", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Core Design Ltd."], "id": 24279, "game_title": "Chuck Rock II: Son of Chuck", "release_date": "1993-01-01", "platform": 20, "players": 1, "overview": "Eighteen months after his victory over Gary Gritter, Chuck Rock is now the owner of the hugely successful \"Chuck Motors\" and has become a father. Kidnapped by his evil enemy Brick Jagger, Chuck Rock is likely to become Chuck Dust, unless somebody rescues him... A sudden crash as Chuck Junior bursts from his play pen \"Goo Goo Gaa Gaa, I'll be back.\"", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Action", "Platform"], "publishers": ["Virgin Games, Ltd."], "alternates": ["Chuck Rock II"]}, {"platform_name": "Sega Game Gear", "developers": ["Core Design Ltd."], "id": 24280, "game_title": "Chuck Rock", "release_date": "1992-01-01", "platform": 20, "players": 1, "overview": "Once upon a rock, there was a primitive prince charming who was more evoled than the rest. His name: Chuck Rock. It's no wonder Ophelia fell for him like a two-ton boulder. They were living happily ever after until Gary Critter-one of Ophelia's many suitors-decided he had to have the lovely Ophelia for himself. So now it's time for you and Chuck to go Critter-hunting.", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": "nSEclmPePxw", "genres": ["Action", "Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Spidersoft"], "id": 24281, "game_title": "Cliffhanger", "release_date": "1994-01-01", "platform": 20, "players": 1, "overview": "Based on the white-knuckle action-adventure movie starring Sylvester Stallone, Cliffhanger challenges you to brave thundering avalanches, icy cliffs, and the head-spinning heights of the Rocky Mountains while you combat a vicious group of well-armed, extremely dangerous fugitives. You'll hang on for dear life through exciting levels requiring all your strength and skill just to survive. Experience wild new forms of game play like mountain climbing and cave exploration, along with all the excitement of all the incredible hand-to-hand and armed combat action. The adventure isn't over until you find $100 million in stolen loot, defeat the fugitives, and reunite with your friends!", "last_updated": "2018-07-11 21:05:33", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sony Imagesoft"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 24282, "game_title": "Clutch Hitter", "release_date": "1991-01-01", "platform": 20, "players": 2, "overview": "Clutch Hitter is a Sports game, developed and published by Sega, which was released in 1991.", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Supersonic Software Ltd."], "id": 24283, "game_title": "Cosmic Spacehead", "release_date": "1993-01-01", "platform": 20, "players": 1, "overview": "Cosmic needs your help! He has no money, no car, and no respect from his fellow Cosmonaut's! The trouble is, no one believed his tale of discovering a far away planet called \"Earth\" so it's your job to help him get back there and take some handy snaps! Starting from his home town Old Lino Town, it's Cosmic gameplay all the way in a unique blend of adventure and arcade action plus a whole galaxy of surprises thrown in!", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": null, "genres": ["Adventure"], "publishers": ["Codemasters"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Software Creations"], "id": 24284, "game_title": "Cutthroat Island", "release_date": "1995-01-01", "platform": 20, "players": 1, "overview": "Sharpen your long swords for the ultimate high seas battle! In plundering two-player action, team up as Morgan and Shaw to uncover a treasure trove of priceless gems and gold bullion! Battle bloodthirsty pirates with knives, pistols and flaming torches!", "last_updated": "2018-07-11 21:05:33", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Biox"], "id": 24374, "game_title": "Ristar", "release_date": "1995-01-01", "platform": 20, "players": 1, "overview": "Ristar, known as Ristar the Shooting Star (リスター・ザ・シューティングスター Risutā za Shūtingu Sutā?) in Japan, is a platform video game released by Sega in 1995 for the Sega Game Gear. While sharing themes and gameplay elements from its main counterpart, Ristar, for the Sega Genesis, it is a largely different game. The game was well received by critics, who felt the gameplay mechanics were transferred over well to the older, aging Game Gear system, but were divided on whether or not the game was worth playing if both versions of the game were available to the consumer. The game received even less exposure than its Genesis counterpart, due to the Game Gear being towards the end of its lifecycle, and having less of a userbase to begin with in comparison to the Genesis.", "last_updated": "2018-07-17 03:58:28", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Codemasters"], "id": 25084, "game_title": "Ernie Els Golf", "release_date": "1994-01-01", "platform": 20, "players": 4, "overview": "Ernie Els Golf is a golf game for the Sega Game Gear released exclusively in Europe.", "last_updated": "2018-07-11 21:05:33", "rating": null, "coop": "No", "youtube": "ZZZ5CGNxmUY", "genres": ["Sports"], "publishers": ["Codemasters"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Compile"], "id": 25085, "game_title": "Dr. Robotnik's Mean Bean Machine", "release_date": "1993-02-01", "platform": 20, "players": null, "overview": "Evil Dr. Robotnik™ has invented a machine that turns good folks into rotten robots! In Mobius, the famous home of Sonic The Hedgehog™, village bean folk are being rounded up and thrown into the Doctor's dungeons, there to await their turn in the steamer!", "last_updated": "2018-08-11 15:01:11", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Novotrade International"], "id": 25086, "game_title": "Ecco: The Tides of Time", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "The evil Vortex has returned and Ecco faces a dangerous adventure. With help from the beautiful Trellia, guide Ecco through over 16 levels of aquatic action including amazing 3D scenes. See Ecco morph into a school of fish, jellyfish and even a seagull as you battle to level the tides of time!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Codemasters"], "id": 25087, "game_title": "The Excellent Dizzy Collection", "release_date": "1993-11-01", "platform": 20, "players": null, "overview": "Three complete games starring game superstar Dizzy! Enjoy the thrill of an arcade action game, a puzzle game and a complete adventure game all in one pack!\r\n\r\n1. Dizzy the Adventurer - Adventure Game\r\nHere's Dizzy - in an amazing magical quest packed with action, mystery, surprises and lots of new interesting characters. Escape from an underground cave and wake Daisy from the endless sleep caused by pricking her finger on a cursed spinning wheel! The spell can only be broken by a kiss from a Prince! A great sense of humour and brilliant fun! A superbly crafted cartoon adventure set in a magical kingdom!\r\nBrilliant graphics, music and a magical quality that will enchant players.\r\n\"A magical quest to wake Daisy from her endless sleep\"\r\n\r\n2. Panic Dizzy - Puzzle Game\r\nIt's puzzling, challenging and mega playable! Play any of the Yolfolk and challenge friends to a choice of 3 brilliant, original puzzle games. There's shape shifter, dizzy dice and picture puzzler to boggle your mind and blow your brain. Push and shoot the descending shapes in a race against time! Fantastic fun!\r\n\"Put your brain & reflexes in to top gear for 3 original puzzle games!\"\r\n\r\n3. Go Dizzy Go! - Action Game\r\nIt's Dizzy and Daisy to the rescue in this zany arcade challenge. Zaks' treacherous worlds are jam packed with all sorts of nasties. Power-Ups and Special secrets! Take up the challenge in single mode or two player mode.\r\nClassic maze style game with 5 worlds each containing 5 levels. Superb graphics, funky music and exciting gameplay!\r\n\"Dash around weird and wonderful worlds to free the yolkfolk!\"", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Codemasters"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tiertex Design Studios"], "id": 25088, "game_title": "FIFA International Soccer", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "EA Sports has teamed up with the governing body of international soccer to bring you the most realistic soccer game ever created on GameGear. Incredible goalie saves - lunge or dive after hard to reach shots in the corners! Unique \"play-finder\" window lets you scope the field on corner kicks and free kicks. Find the open man and hammer the ball into the goal! Drop your opponent onto the turf with a slide tackle. Be careful, slide tackles from behind can result in yellow cards!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Electronic Arts"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 25089, "game_title": "FIFA Soccer 96", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Next generation soccer is here! Features include: Silicon Graphics modeled players utilizing MotionDesign animation technology. New moves including 1-2 passing, fast dribble, volleys, dummies, fakes, and nutmegs! Over 3,500 real players with accurate strengths and weaknesses. Transfer real and custom players to create your dream team. 12 international leagues including English, Scottish, Italian, German and French.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": "BH1dMPIcMB8", "genres": ["Sports"], "publishers": ["EA Sports"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 25090, "game_title": "Fred Couples Golf", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Fred Couples Golf is a Sports game, developed by Sims and published by Sega, which was released in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Novotrade International"], "id": 25091, "game_title": "Garfield: Caught in the Act", "release_date": "1995-12-14", "platform": 20, "players": null, "overview": "Welcome to the colorful world of Garfield and his friends. In this, the first ever 8MB GameGear game, you will see exciting adventures and take part in motion picture escapades which combine action, comedy and lots of attitude. Garfield makes his debut as a TV and video game star in full technicolor glory across hundreds of huge levels, on this, the biggest ever GameGear game!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Minato Giken"], "id": 25101, "game_title": "Dynamite Headdy", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Hot-headed Headdy gets into some real head-banging to thwart the Dark Demon's devious deeds. This wacky headcase is up to his neck in surprises! Switch heads to match the job! Over 15 heads to choose from! Bash heavy objects with Slammer Head! Suck up foes with Vacuum Head! Stick it to your enemies with Spike Head! Headdy's spring-loaded head gets him where he's gotta go! Use it to swing over ledges, grab onto objects and shoot hoops in the basketball bonus round. Use your head to whiz through a radical variety of play! Action, shooting and strategy speed you on to a surprise ending!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Eurocom Entertainment Software"], "id": 25102, "game_title": "Earthworm Jim", "release_date": "1995-01-01", "platform": 20, "players": 1, "overview": "Jim wasn't always a studly super-worm. He was once just a spineless, dirt eater with no real mission in life... Then a cosmic twist of fate placed him in control of an ultra-high-tech-indestructible-super-space-cyber-suit. Now Jim must make it to Princess-What's-Her-Name by staying clear of Psy-Crow, the intergalactic bounty hunter, until the final battle with Queen Slug-for-a-Butt.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Playmates Interactive Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["NMS Software"], "id": 25105, "game_title": "F-15 Strike Eagle", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Strap yourself into the cockpit of America's hottest jet - the F-15 Strike Eagle! With awesome maneuverability and firepower, the F-15 can take on any challenge, anywhere, against anyone! F-15 Strike Eagle is your chance to pilot the powerful jet on dangerous missions in the Persian Gulf. Try to destroy chemical warfare plants and lead an assault against the enemy. Lots of thrilling graphic adventures make the game constantly challenging, always new!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Flight Simulator"], "publishers": ["MicroProse Software, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Biox"], "id": 25106, "game_title": "Factory Panic", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Sneak into the factories owned by a vicious tycoon and get the quality products to the people who rightfully deserve them!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Codemasters"], "id": 25107, "game_title": "Fantastic Dizzy", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Dizzy's cartoon adventure in Zakeria - a magical kingdom ruled by the evil wizard Zaks. Explore the mysterious diamond mines, fabulous caverns, dragon's lair, cloud castle, find secret treasure maps, encounter strange magicians, wizards, trolls, pirates, leprechauns and many other weird and wonderful creatures.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Adventure"], "publishers": ["Codemasters"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 25108, "game_title": "Frogger", "release_date": "1991-01-01", "platform": 20, "players": 1, "overview": "This cancelled update of the classic Frogger almost left the Game Gear on a pretty lonely pile of systems which never received their requisite amphibian auto dodger.\r\n\r\nThankfully, the release of a completed prototype rescued it from that cruelest of fates.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 25109, "game_title": "GP Rider", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "The hottest in motercycle racing games! Show your stuff on mind boggling courses against the top riders and machines in the world!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Al Baker & Associates"], "id": 25110, "game_title": "Home Alone", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Save the neighborhood! Kevin's home alon and housebreakers Harry and Marv are prowling his street. Lay traps and build homemade weapons to blast the sneaky thieves. Dodge stumps and slick ice to outrace the robbers, 'cause time's running out!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Spidersoft"], "id": 25111, "game_title": "Hook", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Your blood is pumping and a chill races down your spine! You've finally come face-to-face with the most infamous pirate of them all, Captain Hook, the fiend who's kidnapped your children and sworn never to let them go. As Peter Pan, this is the fight of your life. Everything that came before - your duel with Rufio, your battles against the pirates, even your soaring flights high above Neverland - are nothing compared to this moment. Lots of fun levels of incredible excitement. Multiple destinations: forests, caves, caverns, towns, lagoons, icy regions, and the Nevertree. Magical items that will give you strength and special powers: apples, leaves, and pixie dust.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sony Imagesoft"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Arc Developments"], "id": 25112, "game_title": "Hurricanes", "release_date": "1994-12-01", "platform": 20, "players": null, "overview": "So you tthought footballs were for playing with... think again! Embark on rollercoaster journey in this platform adventure through eerie mining towns, terrifying, deadly forests and infested jungles. All this to search the stadium - and your only weapon - a football!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["U.S. Gold Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Teeny Weeny Games, Ltd."], "id": 25113, "game_title": "The Incredible Crash Dummies", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Have fun with some real headbangers... THE INCREDIBLE CRASH DUMMIES!! Spare Tire's been dummy-napped, and it's up to Slick 'n' Spin to rescue him from the clutches of The Junkman! Lend 'em a hand as they: Slam and jam on the Crash Test Center tire bounce! Try not to fall head over heels on the Big Top high wire! Go to pieces steering clear of rowdy truckers on The Docks! Shake a leg past snarling dogs and runaway tires at The Junkyard! Knock heads with the Junkman to set Spare Tire free! THE INCREDIBLE CRASH DUMMIES... where fun is a farewell to arms!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Flying Edge, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 25114, "game_title": "The Incredible Hulk", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Busting through a brick wall, Rhino charges the Hulk. KRAASH! As the Rhino closes in, the Hulk prepares to knock him to oblivion. The Hulk lands a gamma-powered uppercut! THWAAP! Bruce Banner contends with The Leader's Robot Warriors' laser blasts. THKOOM! The Leader's Bio-Tech Mutants hurl at the angry Hulk. AAAARRRGGG!!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["U.S. Gold Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tiertex Design Studios"], "id": 25115, "game_title": "Indiana Jones and the Last Crusade", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "The chase is on... all the way to the greatest treasure in history - the Holy Grail! And if you can survive the treacherous caves of Colorado, a savage rat attack, and overcome the deadly traps of the Grail temple, then you're ready for anything the Luftwaffe can throw at you!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Adventure"], "publishers": ["U.S. Gold Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Realtime Associates, Inc."], "id": 25116, "game_title": "Iron Man / X-O Manowar in Heavy Metal", "release_date": "1996-01-01", "platform": 20, "players": null, "overview": "Metal titans, Iron Man and X-O Manowar, come together for the first time ever to tackle one heavy-duty cosmic crisis! It's an apocalyptic meltdown of furious action, with the ultimate in Super Hero power and realism! Featuring Bi-Directional firepower, Chest-Beam blasts, multi-hit combos and Z-axis shooting, ultimate boss battles and enhanced weapon power!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Bits Corporation Limited"], "id": 25117, "game_title": "The Itchy & Scratchy Game", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "They fight, and bite, they fight and bith and fight. Get ready as Itchy & Scratchy slice, dice, crash and bash their way into your home. This cat's gonna need more than nine lives to survive bazookas, grenades, chain saws and flame throwers. There's more than one way to skin a cat. So, are you mouse enough!!!???", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["The Kremlin"], "id": 25118, "game_title": "James Bond 007: The Duel", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "James Bond 007 - A name to strike fear in anyone foolish enough to cross him. Now he's back, in a brand new adventure especially for Sega. Four frantic levels of fast and furious action await you! What are you waiting for?", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Domark Group Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Millennium Interactive Ltd"], "id": 25119, "game_title": "James Pond 3: Operation Starfi5h", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "The sinister Dr. Maybe is back and only our slickest Special Agent, James Pond, can stop him. Special Agent Finnius Frog can help you get to those hard to reach places with his powerful jumping abilities. Explore more than 100 levels of outrageous fun! Win using an ocean of FI5H gadgets: suction boots, the fruit gun, X-ray specs, a thruster unit, spring boots and a clever fruit suit disguise. Use a special FI5H rocket pack to defeat Dr. Maybe! Fry over 40 different enemies under Dr. Maybe's control and avoid Maybe's mounted guns and missile launchers!", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["U.S. Gold Ltd."], "alternates": ["James Pond 3: Operation Starfish"]}, {"platform_name": "Sega Game Gear", "developers": ["GameTek, Inc."], "id": 25120, "game_title": "Jeopardy! Sports Edition", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Jeopardy! Sports Edition is a Miscellaneous game, developed and published by GameTek, which was released in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["GameTek, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["GameTek, Inc."], "id": 25121, "game_title": "Jeopardy!", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Jeopardy 25th Anniversary is a Miscellaneous game, developed and published by GameTek, which was released in 1992.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": null, "publishers": ["GameTek, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 25122, "game_title": "Judge Dredd", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Mega-City One is in ruins. Corruption is rampant. It's time to take the law into your own hands. Armed with explosive Lawgiver firepower - heat seekers, ricochet rockets, incendiary missiles and more - take on Mean Machine, the ABC Robot and other brutal barriers to justice. Take to the skies on your high-speed Lawmaster motorcycle and pacify even the most persistent perps! You're not above the law. You ARE the law!!!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Micronet Co. Ltd."], "id": 25123, "game_title": "Junction", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Junction is a Puzzle game, developed and published by Micronet in 1991.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Micronet Co. Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tengen"], "id": 25124, "game_title": "Klax", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "KLAX - the latest, greatest hit in the arcades - is now available for play on the GameGear! This brainteaser of a game is simple in concept: Catch colored tiles that come down the conveyor belt. Rack up points by arranging them in same-colored stacks or rows. A tic-tac-tile test, if you will. Sounds easy? It is... until the tiles come tumbling at you so fast, you'll go nuts trying to catch them all - while figuring out where best to stack them before you run out of room! But no matter how tough KLAX gets, the hardest part is pulling yourself away from this fun, fast, and totally mind-boggling game!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Tengen"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Bits Studios"], "id": 25129, "game_title": "Last Action Hero", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Last Action Hero blasts you out of the real world - onto the silver screen - and back again, in a non-stop action-adventure based on the epic fantasy feature starring Arnold Schwarzenegger. As movie hero Jack Slater, you'll team up with your biggest fan, Danny Madigan, who's got a magic movie ticket that's the ticket to serious trouble. Leaping between both the movie world and the real world with this magic ticket, you'll get into wild chases and deadly fights with the most dangerous criminals imaginable. Last Action Hero delivers all the excitement of the Schwarzenegger film with just one difference... you're the star! But this time, you must ultimately defeat the arch henchman Benedict to ensure a happy ending.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sony Imagesoft"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tiertex Design Studios"], "id": 25130, "game_title": "Madden NFL '95", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "ACTION! Ultra-competitive computer opponent. New 3-D rendered player moves; straight arms, high steppin', QB slides. Bigger field DEPTH! Complete 1994 NFLPA rosters. 48 player rosters - sub any player in any formation. Over 100 player injuries. Full NFL season, Playoffs and Super Bowl. 28 NFL and All Madden teams. STRATEGY! Windowless passing option forces QBs to read zone or man coverages. All-new Madden-designed defenses. Best play calling logic ever - based on '94-'95 NFL strategies!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["THQ"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tiertex Design Studios"], "id": 25131, "game_title": "Madden NFL '96", "release_date": "1996-01-01", "platform": 20, "players": null, "overview": "All 30 NFL teams, including Jacksonville and Carolina. Hidden codes reveal secret teams and players. Create Player Combine Scouting - Game within the game. All-new 3-D rendered graphics and animations: over-the-top dives, kneeling catches, logos in the end zone, clothesline tackles, left-handed QB/kickers. General Manager feature - trade and sign players. Over 20 new offensive and defensive plays. Full season with Playoffs and Super Bowl.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Electronic Arts"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tengen"], "id": 25132, "game_title": "Marble Madness", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Marble Madness, one of the biggest hits ever in the arcade, now comes to GameGear. As addictive as ever, this version includes six increasingly difficult courses with a variety of traps to slow you down and a host of marble eating monsters.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Tengen"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["The Kremlin"], "id": 25133, "game_title": "Marko", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Welcome to the world of Marko, a world of cartoon madness. Experience the addictive blend of football skills and platform action that combine to make a superb gameplaying experience. Add the most incredible graphics ever to be seen and the result is Marko's Magic Football. It's just like playing a cartoon.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Domark Group Ltd."], "alternates": ["Marko's Magic Football (EU)"]}, {"platform_name": "Sega Game Gear", "developers": ["Virgin Interactive Entertainment"], "id": 25134, "game_title": "Mick & Mack: Global Gladiators", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "The bubble-blowing, goo-shooting, high-fivin' Mick and Mack are unleashed into Sega action in their new global adventure, THE GLOBAL GLADIATORS! Vividly dramatic landscape and scenery fill every world as Mick and Mack spring, dash and blast through the game. From skidding through perilous peaks in a world of ice, to dodging the infamous Red Snappy Piranha in the deep, dark Mystical Forest, Mick and Mack take players through multiple worlds and levels of slime-busting fun! Add Mick and Mack's exclusive high-tech Goo Shooters and you've got a Global Patrol ready to take on the world!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Virgin Interactive Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Designer Software"], "id": 25135, "game_title": "Mickey's Ultimate Challenge", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Mickey's Ultimate Challenge is an Action game, developed by Designer Software and published by Hi Tech Expressions, which was released in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Hi-Tech Expressions, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Codemasters"], "id": 25136, "game_title": "Micro Machines 2: Turbo Tournament", "release_date": "1996-01-01", "platform": 20, "players": 2, "overview": "Micro Machines 2: Turbo Tournament is a Driving game, developed by Codemasters and published by Ocean, which was released in Europe in 1996.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Ocean Software Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Codemasters"], "id": 25137, "game_title": "Micro Machines", "release_date": "1993-01-01", "platform": 20, "players": 2, "overview": "Hit the gas and race on 16 outrageous, high-speed tracks in 8 different worlds. It's totally unique racing action in an oversized world where anything (and everything!) can happen.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Codemasters"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 25138, "game_title": "Mighty Morphin Power Rangers: The Movie", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Based on this summer's blockbuster hit, Power Rangers The Movie delivers action, fighting and adventure! Ivan Ooze has surfaced after six thousand years, and he's in a foul mood! It's up to you and the Power Rangers to stop him before he unleashes a steady stream of destruction on an unsuspecting universe. Introducing for the first time - White Ranger! It's Morphin' time!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 25139, "game_title": "Mighty Morphin Power Rangers", "release_date": "1994-01-01", "platform": 20, "players": 1, "overview": "It's Morphin Time! Five ordinary teens morph into the Power Rangers to foil the plans of the Evil Empress Rita Repulsa and save planet Earth. Choose your favorite Power Ranger color - Red, Yellow, Blue, Pink or Black! Battle huge, fierce and spectacular enemies! Even the Green Ranger and the fearsome Dragonzord!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["High Score Productions"], "id": 25140, "game_title": "MLBPA Baseball", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Never before has a baseball game been created that captures the details of the sport like MLBPA Baseball. Realistic run-downs, accurate cut-off plays, the double switch, multiple defensive alignments, snap throws, even bad hops and booted balls. Throw in every player from Alamar to Zeile and you've got the only baseball game worth playing for the Super NES.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["EA Sports"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 25141, "game_title": "NBA Action starring David Robinson", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "NBA Action starring David Robinson is a Sports game, published by Sega, which was released in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["BlueSky Software"], "id": 25142, "game_title": "NFL '95", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "NFL '95 is a Sports game, developed by Blue Sky Software and published by Sega, which was released in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Acclaim"], "id": 25143, "game_title": "NFL Quarterback Club '96", "release_date": "1996-01-01", "platform": 20, "players": null, "overview": "The top talents in pro football are back with the very best in pigskin pandemonium. It's a whole new game as NFL QUARTERBACK CLUB '96 takes a giant step into the future of football gaming with all new expansion teams, bold new plays and mind blowing graphics! Did someone say dynasty? All the tools and toys are here, 30 teams, over 40 plays, and plenty of action, backed up by impressive, meaningful stats. Your friends say their game is great? They're still in last year's huddle! NFL QUARTERBACK CLUB '96 end the discussion with a concussion! You're taped up, the pads are in place, the cleats are on. Hit the field!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Condor"], "id": 25144, "game_title": "NFL Quarterback Club", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "NFL Quarterback Club, called NFL Quarterback Club '95 in Japan, is an American football game released for the Sega Mega Drive, Sega 32X and Sega Game Gear. It was the first in the NFL Quarterback Club series and was followed by NFL Quarterback Club 96.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Gray Matter"], "id": 25145, "game_title": "NHL All-Star Hockey", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "NHL All-Star Hockey is a Sports game, developed by Gray Matter and published by Sega, which was released in 1995.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Realtime Associates, Inc."], "id": 25146, "game_title": "NHL Hockey", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "NHL Hockey is a Sports game, developed by Realtime Associates and published by EA Sports, which was released in Europe in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Electronic Arts"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["U.S. Gold Ltd."], "id": 25147, "game_title": "Olympic Gold", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Experience for yourself the thrill and excitement of competing in seven spectacular Olympic track, field and pool events. Olympic Gold, the challenge - to win you'll need all the strength, skill and determination you can muster!", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["U.S. Gold Ltd."], "alternates": ["Olympic Gold - Barcelona '92 (EU)"]}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 25148, "game_title": "OutRun Europa", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Outrun Europa - a 7 stage race across Europe, in an attempt to avoid capture. Race across the English Channel on a super-fast jetski, battle bumper-to-bumper with secret agents in your Porsche 911 or Ferrari F40, hit 170 mph through congested streets on your adrenaline-pumping Yamaha GP. Break waves in the Med on your turbo-charged power boat and foil your enemies as you seek to retrieve secret files. This time only your wits, courage and sheer driving skill will determine your fate!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["U.S. Gold Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Now Production Co."], "id": 25149, "game_title": "Pac-Attack", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Pac-Man makes a rare appearance outside of a maze environment in Pac-Attack, a fun and quirky puzzle game. This unique entry in the genre puts its own twist on established conventions and adds one of gaming's most iconic characters to the mix. The goal is simple: Keep your screen clear of falling blocks and ghosts by lining up blocks horizontally, causing them to disappear.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Namco"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Namco"], "id": 25150, "game_title": "Pac-Man", "release_date": "1991-01-01", "platform": 20, "players": 2, "overview": "Gobble, gobble, gulp! Who's munching Power Pellets? Who's zipping around the maze at top speed, chomping up ghosts and scoring big points? It's Pac-Man, the world's hungriest character! Devour a fruit treat and get a big bonus score. But if you're caught by the little haunters, you're ghostflakes! Use the warp tunnel for a quick escape. Hours of ghost-chomping action!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": "Zf0ivfcDEuY", "genres": ["Action"], "publishers": ["Namco"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Manley & Associates, Inc."], "id": 25151, "game_title": "Paperboy 2", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Rise and shine, bud! A great day's ahead, just waiting for you to become the neighborhood's terror of a paperboy. but it's a whole new job with double the fun and twice the excitement! That's right, you've now got houses on both sides of the street - which means even more customers' homes to deliver papers to and non subscribers' homes to damage. It also means you've got to watch out for lots more obstacles and meanies that are out to knock you off your bike! Wreak mischief across the town or do good deeds like saving the baby and stopping the burglar. At the end of the day, hone your skills on the all-new BMX-style test course. Add the new awesome graphics, and you're in for a rip roaring time on your bike!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Tengen"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Codemasters"], "id": 25166, "game_title": "Pete Sampras Tennis", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Pete Sampras Tennis is a Sports game, developed and published by Codemasters, which was released in Europe in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Codemasters"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Ceris Software"], "id": 25167, "game_title": "PGA Tour 96", "release_date": "1996-01-01", "platform": 20, "players": null, "overview": "PGA Tour 96 is a Sports game, developed by Ceris Software and published by Black Pearl, which was released in Europe in 1996.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Black Pearl Software"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sterling Silver Software"], "id": 25168, "game_title": "PGA Tour Golf", "release_date": "1994-05-05", "platform": 20, "players": null, "overview": "A hush comes over the crowd surrounding the 18th hole. After 27,032 yards, 71 holes, and four grueling rounds, a 23-foot birdie putt separates you and your first tournament victory. This is the big-time. PGA TOUR Golf puts all the excitement, fun, challenge and rewards of the real PGA TOUR right in your hands!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Tengen"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Polygon Games"], "id": 25169, "game_title": "PGA Tour Golf II", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "PGA Tour Golf II is a Sports game, developed by Polygon Games and published by Time Warner Interactive, which was released in 1995", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Time Warner Interactive, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Unexpected Development"], "id": 25170, "game_title": "Phantom 2040", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "You are the Phantom, searching for the evil Rebecca Madison in the vast city of Metropia. As head of Maximum, Inc., she will stop at nothing to fulfil her twisted plans to control the world... unless you can overpower her.\r\nVicious bosses and hordes of biots, programmed to destroy you, relentlessly attack of every turn. But you strike back with an arsenal of heavy-duty weapons including a smart gun, inductance rope, homing missile, and many others. Use two weapons at once to double your chances of survival! Then control your destiny as you weave your way through more than 60 incredible levels!\r\nThe danger is staggering. The fate of the city, the eco-system, and all of humanity rests on your abilities. You know what must be done to save Metropia and the world from certain doom.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Viacom New Media"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Spidersoft"], "id": 25171, "game_title": "Pinball Dreams", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Pinball Dreams is a Miscellaneous game, developed by Spidersoft and published by GameTek, which was released in 1995.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["GameTek, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Spidersoft"], "id": 25172, "game_title": "Poker Face Paul's Blackjack", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Poker Face Paul's Blackjack is a Miscellaneous game, developed by Spidersoft and published by Adrenalin Interactive, which was released in 1993.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Adrenalin Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Spidersoft"], "id": 25173, "game_title": "Poker Face Paul's Gin", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Poker Face Paul's Gin is a Miscellaneous game, developed by Spidersoft and published by Adrenalin Interactive, which was released in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Adrenalin Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Spidersoft"], "id": 25174, "game_title": "Poker Face Paul's Solitaire", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Poker Face Paul's Solitaire is a Miscellaneous game, developed by Spidersoft and published by Adrenalin Interactive, which was released in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Adrenalin Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Spidersoft"], "id": 25175, "game_title": "Poker Face Paul's Poker", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Poker Face Paul's Poker is a Miscellaneous game, developed by Spidersoft and published by Adrenalin Interactive, which was released in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Adrenalin Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Rage Software"], "id": 25176, "game_title": "Power Drive", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Burn through blizzards in Monte Carlo at midnight or race in the blistering desert heat of Kenya. Test your rally skills through the dense forests, dizzy mountain passes and icy frozen lakes of different international courses! POWER DRIVE... drive it if you dare!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["U.S. Gold Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Teeny Weeny Games, Ltd."], "id": 25177, "game_title": "Predator 2", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Predator 2... He's in town with a few days to kill! For the Predator, it is the ultimate sport - the killing of human prey. For the citizens of Los Angeles, it is a nightmare beyond belief. And for Detective Lieutenant Mike Harrigan, it's another dirty job that's got to be done... It's kill or be killed!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Arena Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 25178, "game_title": "Primal Rage", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Select one of the ferocious dinosaurs then pound your opponents into submission as you battle for Urth Domination. Blizzard's Freeze Breath and Ice Geyser fighting moves stop you cold just before his Mega Punch hammers you senseless. Diablo's Inferno Flash cooks up a firestorm in one dino barbecuing breath, and the foul, disgusting Chaos dazes you with an abundant supply of Power Puke, Farts of Fury, and Flying Butt Slams. Armadon's Gut Gouger and Gut Fling, Sauron's Cranium Crusher and Talon's Face Ripper and Shredding and Vertigo's Scorpion Sting - every original arcade fighting and fatality move is at your fingertips! Get Ready to Rage!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Time Warner Interactive, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["BrÃ¸derbund Software, Inc."], "id": 25179, "game_title": "Prince of Persia", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Your sword fighting skills will be tested to the full in this amazing puzzle solving challenge. A multitude of secret passages, fantastic rooms, violent opponents and magic potions await you in a bid to foil the evil Grand Vizier Jafar and rescue the beautiful princess to become the PRINCE OF PERSIA.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Tengen"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Hertz"], "id": 25180, "game_title": "Psychic World", "release_date": "1991-04-26", "platform": 20, "players": 1, "overview": "Maddening...\r\n\r\nYour sister has been abducted by mutants. But where have they taken her? And why?\r\nTravel through four fantastic worlds of fire and ice to find her. Call on your basic psychic powers to overcome dangerous monsters and deadly machines.\r\n\r\nAlong the way, you’ll pick up ESP skills. Use them to wrench your sister from the clutches of the evil mutants. And use them\r\nwell. Your life - and your sister’s depend on it!\r\n\r\nCan the powers of ESP overcome the powers of Evil?", "last_updated": "2018-07-17 03:58:28", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 25181, "game_title": "Putt & Putter", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Now you can enjoy miniature golf on the go, with Putt & Putter for the Sega GameGear! Bank shots, water hazards, treadmills and pinball-style bumpers are all here for your amusement! By far the craziest version of miniature golf ever designed.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Compile"], "id": 25191, "game_title": "Power Strike II", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Power Strike II is an Action game, developed by Compile and published by Sega, which was released in Europe in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": "2cZs0-8zepk", "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Absolute Entertainment"], "id": 25192, "game_title": "R.C. Grand Prix", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "R.C. Grand Prix is a Driving game, developed by Imagineering Inc and published by Absolute Entertainment, which was released in 1992.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Absolute Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Realtime Associates, Inc."], "id": 25193, "game_title": "Quest for the Shaven Yak starring Ren Hoek & Stimpy", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Bizarre perils await the TV heroes Ren & Stimpy on their torturous quest to return the hooves of the Great Shaken Yak!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": "PgypXA109Is", "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Micronet Co. Ltd."], "id": 25194, "game_title": "Riddick Bowe Boxing", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Riddick Bowe Boxing is a Sports game, developed by Micronet and published by Extreme Entertainment Group, which was released in 1993.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Extreme Entertainment Group"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Time Warner Interactive"], "id": 25195, "game_title": "Rise of the Robots", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "REBEL ROBOTS RULE METROPOLIS 4. Half-human, half-machine... It's up to you to crush the android revolution with metal-mashing warfare and devastating super-moves. Get ready for turbo-charged gameplay, brutal Artificial Intelligence, and revolutionary 3D graphics that change the way you look at fighting games!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["Time Warner Interactive, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Eden Entertainment Software"], "id": 25196, "game_title": "Robocop 3", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Old Detroit. The streets are full of danger. Only one man can stand alone against such numbers - ROBOCOP! With state of the art weaponry, a skin of steel and nerves to match, he stalks his prey... evil-doers everywhere!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Flying Edge, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["NMS Software"], "id": 25197, "game_title": "Robocop versus The Terminator", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "In the crumbling ruins of a world under siege, man-machine meets machine-man as legendary cyborgs clash to decide the fate of the Earth. As Robocop, you must travel across time into a bloody future ruled by the mechanical forces of Skynet. You'll face attack from every angle, every moment. An unwavering army of Terminators, robotic dogs, spiders, Endoskeletons and a relentless arsenal of automated weapons await you in this veritable hell on earth. To destroy this enemy, free its hostages and finally pierce the dark heart of a killer computer. It will take something more powerful than plasma rifles and laser guns: the human mind that still burns within you.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Virgin Interactive Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 25198, "game_title": "Ronald McDonald in Magical World", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Ronald McDonald in Magical World is an Action game, developed by Sims and published by Sega, which was released in Japan in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Zeppelin Games Limited"], "id": 25199, "game_title": "Man Overboard! S.S. Lucifer", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "You've really been dropped in the deep end this time. The Steam Ship is on a oneway trip to the seabed after a collision with an iceberg. It's jam packed with panic stricken passengers waiting for their hero, Kevin, to come to the rescue. Playing the part of Kevin, you have to guide the Passengers through some of the worst hazards encountered in modern games playing before the compartments become flooded and time runs out.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Codemasters"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Takara"], "id": 25200, "game_title": "Samurai Shodown", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Iza To! En Garde! Dude! Twelve of the mightiest samurai, ninja, knights, and warriors from Japan, France, the United States, and China lock swords in SAMURAI SHODOWN. With blades, bare knuckles, rage, and various Methods of Mayhem, fight your way to the final battle with Satan's Shogun. Use all powers at your disposal to get a head!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["TAKARA Co., Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Electronic Arts"], "id": 25201, "game_title": "Scratch Golf", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Scratch Golf is a Sports game, developed by Electronics Application and published by Vic Tokai, which was released in Japan in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Vic Tokai"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 25202, "game_title": "Sega Game Pack 4-in-1", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Sega Game Pack 4 in 1 is a compilation for the Sega Game Gear. It was only released in Europe.\r\n\r\nIncluded are four untitled games - a Columns clone, in which the player aims for groups of four pieces rather than lines of three, a simple penalty shoot-out game, a basic rally game and a simple tennis game (where the umpire is Sonic the Hedgehog).", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sensible Software"], "id": 25204, "game_title": "Sensible Soccer: European Champions", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Sensible Soccer: European Champions is a Sports game, developed by Sensible Software and published by Sony Imagesoft, which was released in Europe in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sony Imagesoft"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tiertex Design Studios"], "id": 25205, "game_title": "Shaq Fu", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Shaq brings his awesome skill and size to a multiworld fighting game! As Shaq, use your lightning-fast shuriken and other martial art techniques to prevail over a bunch of intensely evil warriors in the enforcement of justice. Summon Voodoo's bone-shattering earthquake, rebound with Rajah's shockwave sword or lash out with Sett's terrifying mummy wrap! Scores of secret power moves to discover and master!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["Electronic Arts"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Data East USA"], "id": 25206, "game_title": "Side Pocket", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Chalk up your cue stick and rack up those balls. Now get ready, get set, break! The balls scatter and the match is on... It's the Data East Pool Tournament Finals, and you're behind the 8-ball! It'll take a steady hand and a sharp eye to hustle your way to the top. Challenge your opponents to the ultimate game of skill, but you've got to stay cool... It's a green felt jungle out there!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Data East Corporation"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Audiogenic Software Ltd."], "id": 25207, "game_title": "Krusty's Fun House", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Hey, kids! Give a hoot! Help out your old pal Krusty the Clown! My official Krusty's Fun House is infested with rats! I've got my loyal cadets, Bart and Homer Simpson, Sideshow Mel, and Corporal Punishment to guard the rat traps, but I need you to lead the filthy rodents into those traps! Then we blow 'em up! We incinerate 'em! We laser-blast 'em! We electrocute 'em! We Krusterize the little stinkers! Hoo boy! Did I mention the snakes, aliens and flying pigs? Well, watch out for those riffraff! If you can't Krusterize 'em, at least avoid 'em... they're worse than the #@!*%! rats! Making Krusty's Fun House vermin-free is not a pretty task, kiddy cadets - but someone's gotta do it!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": "YMAdqyRX1lA", "genres": ["Platform"], "publishers": ["Flying Edge, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Loriciels"], "id": 25208, "game_title": "Slider", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "As Slider, you must stop the poisoning of your homeland, Rozen, by the diabolical Scum lords!", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": ["Skweek"]}, {"platform_name": "Sega Game Gear", "developers": ["Bit Managers"], "id": 25210, "game_title": "The Smurfs", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Gargamel has already captured three Smurfs. Smurf to their rescue! Smurf down the mountains riding on a sledge, explore the labyrinths of the mine, travel on the back of a stork... but beware of nasty enemies such as the Buzz flies, the Angry Smurfs, the Howlibird, Azrael and... Gargamel!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Infogrames Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Beam Software"], "id": 25211, "game_title": "Solitaire Funpak", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Solitaire FunPak brings the challenge of this great card game to your Game Boy with a dozen variations to keep you coming back for more. Try your hand at Klondike, Pyramid, Free Cell, Golf, Aces Up, Poker, Florentine - 12 in all. Choose whichever game you like or select Tournament mode and try them all. At home or on the road, Interplay's Solitaire lets you play anywhere, anytime. Plays just like the real thing (except you can't cheat!). If you're up to the task, take on this pack for hours of challenging fun!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Interplay Entertainment Corp."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sankindo"], "id": 25212, "game_title": "Solitaire Poker", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Try your hand at the hottest video poker game around! Even seasoned veterans will find Solitaire Poker a welcome challenge!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 25213, "game_title": "Sonic Blast", "release_date": "1996-01-01", "platform": 20, "players": null, "overview": "Fully rendered graphics thrust Sonic into an exciting 3D playing environment. An all new gameplay perspective puts you in the middle of Sonic's 3D adventure! The evil genius Robotnik is after the Chaos Emeralds and it's up to Sonic to stop him. Rescue the innocent Flickies before Robotnik turns them into part of his evil plan!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 25215, "game_title": "Super Smash T.V.", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Congratulations! You're the next lucky contestant on the game show with the ultimate in prizes... YOUR LIFE! Pick six futuristic weapons and defeat hordes of cyborg mutants, power orbs, assault tanks and the 30-ton mutoid man!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Flying Edge, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 25216, "game_title": "Sonic 2 In 1: Sonic 2 + Sonic Spinball", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Sonic 2 In 1: Sonic 2 + Sonic Spinball is a Miscellaneous game, developed by Aspect and published by Sega, which was released in Europe in 1995", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Bits Studios"], "id": 25217, "game_title": "Spider-Man", "release_date": "1992-06-01", "platform": 20, "players": 1, "overview": "The sinister Kingpin is back in town, and his secret plan to destroy Spider-Man is in its final, fiendish stages! The Kingpin has planted a bomb in New York City and has put the blame on Spidey! \r\n\r\nLaw-abiding citizens everywhere are out to get Spider-Man—and who wouldn't be with a $1,000,000 price on his arachnid head!!! All the Kingpin's henchmen are in on the scheme—Dr. Octopus, The Lizard, Electro, Venom and more!\r\n\r\nSo web-swing into action and \"defuse\" this situation...before it explodes in your face!!!", "last_updated": "2018-08-11 15:01:11", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Flying Edge, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Software Creations"], "id": 25218, "game_title": "Spider-Man & X-Men: Arcade's Revenge", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Spider-Man and his mutant pals need your help to escape from Arcade's diabolical amusement park - battling killer clowns, hungry piranhas, lethal doom balls and deadly robot replicas of super-villains like Carnage and Juggernaut! Will Spidey's webs, Wolverine's claws, Gambit's energy cards, Storm's lightning bolts and Cyclops' optic blasts mean GAME OVER for Arcade?", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Flying Edge, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Bits Studios"], "id": 25219, "game_title": "Spider-Man: Return of the Sinister Six", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Doctor Octopus™ is planning the crowning caper of his criminal career... to RULE THE WORLD! He has reunited The Sinister Six™: Electro™, Sandman™, Mysterio™, The Vulture™ and Hobgoblin™. Nothing stands in the way of these reunited Super Villains... except your friendly neighborhood Spider-Man®!", "last_updated": "2018-08-11 15:01:11", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Flying Edge, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Unexpected Development"], "id": 25220, "game_title": "Sports Illustrated: Championship Football & Baseball", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Sports Illustrated: Championship Football & Baseball is a Sports game, developed by Unexpected Development and published by Black Pearl, which was released in 1993.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Black Pearl Software"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Adrenalin Entertainment"], "id": 25221, "game_title": "Sports Trivia: Championship Edition", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Sports Trivia is a Miscellaneous game, developed by Adrenalin Entertainment and published by Sega, which was released in 1995.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": null, "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Absolute Entertainment"], "id": 25222, "game_title": "Star Trek: Generations: Beyond the Nexus", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Star Trek: Generations: Beyond the Nexus is a Simulation game, developed and published by Absolute Entertainment, which was released in 1995.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Flight Simulator"], "publishers": ["Absolute Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Absolute Entertainment"], "id": 25223, "game_title": "Star Trek: The Next Generation: Advanced Holodeck Tutorial", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Star Trek: The Next Generation: Advanced Holodeck Tutorial is a Simulation game, developed and published by Absolute Entertainment, which was released in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Life Simulation"], "publishers": ["Absolute Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 25224, "game_title": "Stargate", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Travel through the StarGate to a new intergalactic dimension of non-stop action, danger and adventure! Face a hostile and unknown world in a wide variety of incredible missions. StarGate will take you a million light years from home... but can you find your way back?", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Biox"], "id": 25225, "game_title": "Streets of Rage", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Axel, Adam and Blaze - ex-cops, the solution to punk pollution. The city's a war zone, and they're going out two at a time to give the gangs a kick in the guts. This is the ultimate in street combat. These city fighters are martial arts maniacs with a battery of individually controllable attacks - including jabs, head butts, and overhead kicks. They're up against a mob of Kung-Fu creeps and axe-hurling fiends. On the streets it's only two of them against hordes of attacking scum. Slam into pipe-wielding weirdos and bash 'em with their own metal. Throw an uppercut or an elbow smash - these goons keep comin'!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Biox"], "id": 25226, "game_title": "Streets of Rage 2", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Original rumblers Axel and Blaze slam the asphalt with bigger, better, totally devastating attacks! Skull-crushing ex-wrestler Max Thunder joins up with earth-shattering body slams and spinning fist attacks. New thrasher Skate slices punks with high speed in-line skate attacks and spinning jump kicks. Go maniac with jaw-shattering, bone-busting punches, head-cracking jump kicks and secret weapons. Gangs of dirt bikers dive into you from every side. Smash 'em with a pipe as they speed by.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["Sega"], "alternates": ["Streets of Rage II (EU)"]}, {"platform_name": "Sega Game Gear", "developers": ["Tiertex Design Studios"], "id": 25227, "game_title": "Strider Returns: Journey From Darkness", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "The warrior returns with a vengeance in his ultimate fight for freedom! A flash of steel, a blast from his devastating laser Gyro gun - Strider's back in action, pulverizing the enemy and striving for justice. This time, there will be NO LIMITS... NO MERCY... NO SURRENDER!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["U.S. Gold Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Rage Software"], "id": 25228, "game_title": "Striker", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Striker is a Sports game, developed by Rage Software and published by Sega, which was released in Europe in 1994", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Absolute Entertainment"], "id": 25229, "game_title": "Super Battletank", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Super Battletank is an Action game, developed by Absolute Entertainment and published by Majesco Games, which was released in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Majesco Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 25230, "game_title": "Super Columns", "release_date": "1995-06-01", "platform": 20, "players": null, "overview": "Super Columns is charged with new ways to play and win at this intensely gripping puzzle game. Magic gems can suddenly flip the screen while Bomb gems can blast up to 5 gems at once! Hook up to a friend with your Gear to Gear connection and really test your skills!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": null, "id": 25231, "game_title": "Super Golf", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Super Golf is a Sports game, published by Sigma Ent. Inc., which was released in Japan in 1991.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sigma Ent. Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Graftgold Ltd."], "id": 25232, "game_title": "Super Off Road", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Super Off-Road is the ultimate off-road racing event. Four tough trucks speed around rough and ready tracks packed with pitfalls, power-boosters and prizes. No one knows the meaning of sportsmanship here. Have you got the skill and determination to come out on top?", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Virgin Games, Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 25244, "game_title": "T2: The Arcade Game", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "T2: The Arcade Game is an Action game, developed by Probe Entertainment Limited and published by Arena, which was released in 1993.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Arena Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Taito Corporation"], "id": 25245, "game_title": "Chase H.Q.", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "The fastest, most thrilling, 3D driving game yet! Take the wheel of your turbo-charged Porsche as you and your partner go in pursuit of dangerous criminals all driving an evil array of souped-up roadsters. TURBO BOOST! Need to catch up in a hurry? Well, just one press of your Turbo Button will leave your eyes in the back of your head! Barrelling through the city streets, along the roughest of dirt tracks and through busy tunnels - if you can hold the line! The low-life can run, but they can't hide...", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": "PgxhPBvPPd8", "genres": ["Racing"], "publishers": ["Taito Corporation"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Eurocom Entertainment Software"], "id": 25246, "game_title": "Tarzan: Lord of the Jungle", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Tarzan is an Action game, developed by Eurocom Entertainment Software and published by GameTek, which was released in Europe in 1994.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["GameTek, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Arc Developments"], "id": 25247, "game_title": "Terminator 2: Judgment Day", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Terminator 2: Judgment Day is an Action game, developed by Arc Developments and published by Flying Edge, which was released in 1993.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Flying Edge, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Probe Entertainment"], "id": 25248, "game_title": "The Terminator", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "Kyle Reese, a lone warrior from the future, returns to the past to protect the one woman who holds the key to the survival of the human race. Together they must face not only everything Los Angeles has to throw at them but also the terrifying might of a cyborg known at the Terminator... who will stop at nothing to kill them both.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Virgin Interactive Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 25249, "game_title": "Tom and Jerry: The Movie", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Oooooh, that mouse! If there's one thing Tom can't stand, it's a rascally rodent named Jerry, and if that mouse isn't careful, Tom is going to nab him. But Jerry is pretty tricky. So muster up all your feline courage, Tom, 'cause there's a dangerous little mouse in the house!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Beam Software"], "id": 25250, "game_title": "True Lies", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "It's not like he's saving the world or anything. Oh, yes it is! As special agent Harry Tasker, it's up to you to prevent a nuclear holocaust and stop the Crimson Jihad! Experience all the explosive intensity of TRUE LIES! All the action of the movie mega hit - and none of the romance!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 25263, "game_title": "Sonic & Tails", "release_date": "1993-11-23", "platform": 20, "players": 2, "overview": "Join Sonic & Tails in another adventure to defeat the evil Dr. Robotnik. It's a robot smashing, tail burning good time. Oh and BTW this gamegear game is the japanese version, the equivalent English version is Sonic the Hedgehog Chaos", "last_updated": "2018-07-11 21:05:34", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tiertex Design Studios"], "id": 25320, "game_title": "Super Space Invaders", "release_date": "1991-01-01", "platform": 20, "players": 2, "overview": "Space Invaders is the most famous video game ever! Now SUPER SPACE INVADERS has arrived with a host of amazing new features - wave after wave of weird and hostile aliens, fantastic multiway scrolling playfields, huge end of level mega monsters and secret levels for only the best to find! It'll drive you crazy, but you won't be able to leave it alone!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Domark Group Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Graftgold Ltd."], "id": 25321, "game_title": "Superman: The Man of Steel", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Lois Lane has been kidnapped by Braniac. The Doom Star orbits the Earth. The deadliest adversaries Superman has ever encountered are running amok. What greater challenge for The Man of Steel, his Heat Vision, and the might of his Super Punch?", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Adventure"], "publishers": ["Virgin Interactive Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["NuFX"], "id": 25322, "game_title": "Surf Ninjas", "release_date": "1993-08-20", "platform": 20, "players": 1, "overview": "As Johnny McQuinn, you’ve got a date with destiny. Return to Patu San and claim your birthright as its ruler! There’s only one catch. First you've got to achieve ultimate mastery of the martial arts. What's next? Peer into the future. not with a crystal ball, but with Sega Game Gear system. Then kick into action to combat Colonel Chi‘s infamous ninja death squads and regain your kingdom!!", "last_updated": "2018-08-11 15:01:11", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Interactive Designs"], "id": 25323, "game_title": "Disney's TaleSpin", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Soar into the wild blue yonder with Kit and Baloo, your madcap buddies. Scramble to win the world's zaniest flying contest ever, in Higher for Hire's famous flying machine, the Sea Duck. The prize: a lucrative air-transport contract and glory for all! Fly in the face of adversity as you compete against Shere Khan. Fend off lowdown high-altitude strikes by Air Pirate Don Karnage. This airborne bully will stop at nothing to see you fail! You've got non-stop ground action, too. Leap quagmires, ford rivers, and swing from vines through a treacherous jungle. So strap on your goggles, and hang on for dear life as you soar into the wildest adventure in aviation history!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Eurocom Entertainment Software"], "id": 25324, "game_title": "Tesserae", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Tesserae is a Puzzle game, developed by Eurocom Entertainment Software and published by GameTek, which was released in 1993.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": "8gjNpoV4B9E", "genres": ["Puzzle"], "publishers": ["GameTek, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Rage Software"], "id": 25325, "game_title": "Ultimate Soccer", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "You're on the pitch, ready to kick off. The crowd is going crazy. The season has been long and challenging. You've been up against a lot of teams and come out on top, and today's the day - to prove that you have the skill and determination to become the Ultimate Soccer champion!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Electronic Arts"], "id": 25326, "game_title": "Urban Strike", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "Save the cities of the U.S.A. from Armageddon in ten spectacular multiple-stage missions! Leave your copter and fight on foot. New choppers and ground assault vehicles. New timed sequences, power-ups and interactive control panels.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Electronic Arts"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Syrox Developments"], "id": 25327, "game_title": "VR Troopers", "release_date": "1995-01-01", "platform": 20, "players": null, "overview": "VR Troopers is an Action game, developed by Syrox Developments and published by Sega, which was released in 1995.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 25328, "game_title": "Virtua Fighter Animation", "release_date": "1996-08-09", "platform": 20, "players": 2, "overview": "Take the Virtua Fighter arcade experience wherever you go! Challenge the world's greatest fighters in the World Fighting Tournament! Crush your opponent with fighting moves straight from Virtua Fighter 2 arcade game!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Realtime Associates, Inc."], "id": 25329, "game_title": "WWF Raw", "release_date": "1994-01-01", "platform": 20, "players": 1, "overview": "With WWE Raw, you can bring more than 35 WWE superstars into your living room. This game puts you inside the squared circle to compete against your favorite wrestlers in a variety of match types, including tag team, King of the Ring, and more. Each player has his or her own finishing moves, entrances, and entrance effects. Set up tournaments against the game's AI, or face off against three of your friends in multiplayer modes.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": "QpA4ib49ubs", "genres": ["Fighting"], "publishers": ["Acclaim Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Teeny Weeny Games, Ltd."], "id": 25334, "game_title": "WWF Wrestlemania: Steel Cage Challenge", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "WWF Wrestlemania: Steel Cage Challenge is a Sports game, developed by Teeny Weeny Games and published by Flying Edge, which was released in 1993.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["Flying Edge, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Imagitec Design Inc."], "id": 25335, "game_title": "Wheel of Fortune: Featuring Vanna White", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Now you can play your favorite TV Game Show on the go anytime! Press the button, hear the theme music; spin the wheel and win a fortune; hit bankrupt and lose it all. You get everything you see on TV - great graphics and animation, a colorful spinning wheel, and our very own blonde hostess to turn the letters. Even the music is authentic. There are dozens and dozens of challenging puzzles to keep you guessing, and if you're stuck you can always buy a vowel. Get set to spin... it's time to play WHEEL OF FORTUNE!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["GameTek, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 25336, "game_title": "Wimbledon", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Control one of the world's top players, or enter yourself in the Tour and test your skill. Featuring fast, heart-stopping action from beginning to end! Overhead smashes, blazing serves, passing shots, a practice mode and four prestigious tournaments - this game's got it all!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 25337, "game_title": "Winter Olympics Lillehammer '94", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Play the hottest game on ice and snow - Winter Olympic Games, the official licensed version of the 1994 Lillehammer Olympic Winter Games. Ten events with actual courses used in Lillehammer. Compete with 1 - 4 players, or challenge Olympic Game records. Sixteen countries to represent including Canada, United States, France and Japan. Eight languages including English, French, Spanish, German and Norwegian.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Core Design Ltd."], "id": 25338, "game_title": "Wolfchild", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Using his father's scientific knowledge, Saul Morrow transforms himself into the powerful WOLFCHILD and seeks revenge on the evil Chimera organization who have murdered his family and kidnapped his father. Guide Saul in his quest to rescue his father from the clutches of the corrupt Chimera corporation. Change his form to that of a powerful psychic werewolf as you fight your way through 5 levels of action-packed adventure, featuring over 400 screens of exciting and addictive gameplay!", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Virgin Interactive Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["West One"], "id": 25339, "game_title": "Wonder Boy: The Dragon's Trap", "release_date": "1992-01-01", "platform": 20, "players": null, "overview": "A Dragon's Curse can be hazardous to your humanity! Join Wonder Boy on his quest to end his curse and regain his human form.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Adventure"], "publishers": ["Sega"], "alternates": ["Wonder Boy III: The Dragon's Trap"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 25340, "game_title": "Woody Pop", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "The Mad Machine has shut down the Enchanted Mansion toy factory. Massive barricades have been set up, blocking off all contact with the outside world. The only thing the crazed machien didn't count on was resistance from a courageous wooden toy--Woody Pop! Join Woody as he clashes with mechanized forces and nearly impossible barriers.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tengen"], "id": 25341, "game_title": "Tengen World Cup Soccer", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "The game has an unusual naming scheme. In Japan there were no issues, as the game was published by SIMS themselves. In North America and PAL regions however, publishing rights were given to Tengen, who altered many of the in-game banners and renamed the game Tengen World Cup Soccer, even though the majority of the work was done by SIMS.\r\n\r\nThe game offers 24 different national teams from across the world, although the choices aren't based on any official tournament from the era. For 1993 the list is quite out of date; the Federal Republic of Germany (more commonly known as West Germany) had not existed since 1990 after the fall of the Berlin Wall, Russia is represented with the flag of the Soviet Union which dissolved in late 1991, and Yugoslavia had ceased to exist by mid-1992.", "last_updated": "2018-07-11 21:56:28", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Tengen"], "alternates": ["Kick & Rush (JP)"]}, {"platform_name": "Sega Game Gear", "developers": ["Tiertex Design Studios"], "id": 25342, "game_title": "World Class Leaderboard Golf", "release_date": "1991-01-01", "platform": 20, "players": null, "overview": "Choose from three of the world's most challenging courses. Like St. Andrews, the most revered course in golf and Doral Country Club, Florida's \"Blue Monster.\" Or play Cypress Creek, the largest and finest in Texas.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": ["World Class Leaderboard (EU)"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 25343, "game_title": "World Series Baseball '95", "release_date": "1994-01-01", "platform": 20, "players": 2, "overview": "700 MAJOR LEAGUE PLAYERS\r\nINCLUDING SANDERS, BONDS, BELLE, GWYNN, BAGWELL, PIAZZA, MCGRIFF, AND PUCKETT.\r\n\r\n-Improved sound effects, music, and announcers put you in the ballpark.\r\n-32 bit technology allows for a gradual zoom to the outfield, for better views of players making diving catches, and climbing the walls to rob home runs.\r\n-The power of 32X allows for enhanced colors of all stadiums and logos.\r\n-Put together the greatest team in history with 50 all time great Legend players.\r\n-Multi-player option allows you and your friends to battle it out!\r\n-Mid-season All-Star game with your season's best players.\r\n-Track stats for individuals, teams and league leaders.\r\n-Play in Exhibition, Full Season, and Playoff modes plus 2 Home Run Derby Modes.\r\n-Draft and Trade players to create your own dream squad.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": ["Nomo's World Series Baseball"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 25344, "game_title": "X-Men: Mojo World", "release_date": "1996-01-01", "platform": 20, "players": 1, "overview": "The X-Men face their most brutal adventure ever. Spiral a beautiful 6-armed television producer and denizen of Mojo World pits the X-Men against their all-time toughest foes in the ultimate televised slugfest, \"The Greatest Battles of the X-Men\"! If her scheme works the citizens of Mojo World will tune-in and she will become their new ruler.", "last_updated": "2018-07-11 21:05:34", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Gremlin"], "id": 25345, "game_title": "Zool", "release_date": "1993-01-01", "platform": 20, "players": null, "overview": "Once every year, the games world is rocked by a game so stunning, so fast, so colorful, so big, so demanding, so mega, so awesome, so varied , so incredible, and so full of fabulous features and unexpected treats, that everybody just looks at it and says \"THAT'S IT!\" This year, ZOOL, THE NINJA FROM THE Nth DIMENSION, is definitely \"IT!\"", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["GameTek, Inc."], "alternates": ["Zool: Ninja of the"]}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 26759, "game_title": "Sassou Shounen Eiyuuden: Coca Cola Kid", "release_date": "1994-08-05", "platform": 20, "players": 1, "overview": "Cokey must hit the streets and take on Team Evil who just went and kidnapped his teacher, Ms. Sakurako. Skate through the city and be brave!", "last_updated": "2018-07-11 21:57:46", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": ["颯爽少年英雄伝 コカ・コーラ キッド"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 26760, "game_title": "Sonic Drift", "release_date": "1994-03-18", "platform": 20, "players": 2, "overview": "The evil Dr. Eggman has stolen the chaos emeralds and you have to win them back in a racing tournament. In Sonic Drift, you can play as Sonic, Tails, Amy, or Robotnik.", "last_updated": "2018-07-11 21:45:19", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Sega"], "alternates": ["ソニック ドリフト"]}, {"platform_name": "Sega Game Gear", "developers": ["Namco"], "id": 26930, "game_title": "Galaga 91", "release_date": "1991-04-01", "platform": 20, "players": 1, "overview": "Galaga '91 (ギャラガ’９１) is a sequel to Namco's 1981 arcade classic, Galaga (brought to the SG-1000 as Sega-Galaga). It is actually a port of Galaga '88, originally released in arcades in 1988, retitled to reflect its Sega Game Gear release of 1991.\r\n\r\nGalaga '91 can cause confusion not just because of its arcade origins three years prior, but because in Europe, this Game Gear version was retitled (again) as Galaga 2, being marketed as a direct sequel to Galaga. It is, however, the fourth game in the series; being preceeded by the 1979 arcade game, Galaxian, Galaga in 1981 and finally Gaplus in 1984 (sometimes called Galaga 3 - an equally misleading title). To make matters worse, Namco released an arcade sequel called Galaxian³ (also known as Galaxian 3') in 1990, and the TurboGrafx-16 port of Galaga '88/'91 is called Galaga '90. More recent games have opted to avoid numbering systems and always use the Galaga name.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Namco"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Riverhill Soft Inc."], "id": 27360, "game_title": "Buster Ball", "release_date": "1992-03-20", "platform": 20, "players": 2, "overview": "Buster Ball is an Action game, published by Riverhillsoft, which was released in Japan in 1992.", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Riverhill Software Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 27361, "game_title": "Buster Fight", "release_date": "1994-02-11", "platform": 20, "players": 2, "overview": "Buster Fight is an Action game, developed by Sims and published by Sega, which was released in Japan in 1994.", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Inter State"], "id": 27362, "game_title": "Berlin no Kabe", "release_date": "1991-11-29", "platform": 20, "players": 2, "overview": "The Berlin Wall is an Action game, developed by Inter State and published by Kaneko, which was released in Japan in 1991.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Kaneko Co., Ltd."], "alternates": ["The Berlin Wall"]}, {"platform_name": "Sega Game Gear", "developers": ["Minato Giken"], "id": 27363, "game_title": "Crayon Shin-chan: Taiketsu! Quantum Panic!!", "release_date": "1995-02-24", "platform": 20, "players": 2, "overview": "Crayon Shin-chan: Taiketsu! Kantamu Panic!! (クレヨンしんちゃん 対決！カンタムパニック！！) is an action game for the Sega Game Gear released only in Japan. It is based upon the Crayon Shin-chan anime.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Bandai Co., Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27364, "game_title": "Doraemon Waku Waku Pocket Paradise", "release_date": "1996-04-26", "platform": 20, "players": 2, "overview": "Doraemon Waku Waku Pocket Paradise (ドラえもん ワクワクポケットパラダイス) is an action game for the Sega Game Gear. It is based upon the 1979 Doraemon anime series.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27365, "game_title": "Dunk Kids", "release_date": "1994-09-23", "platform": 20, "players": 2, "overview": "Dunk Kids (ダンクキッズ) is a basketball game for the Sega Game Gear. It was only released in Japan.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Novotrade International"], "id": 27366, "game_title": "Ecco the Dolphin", "release_date": "1994-03-11", "platform": 20, "players": 1, "overview": "You are Ecco, a powerful young dolphin. A mysterious storm has swept your family from the sea. The search to find them will take you through vast underwater realms of treachery, beauty and adventure. Use your sonar to discover hidden caverns and unlock the secrets of crystal glyphs. Charge packs of bloodthirsty sharks. Dive deep... but don't linger too long, because you're a mammal and need air to breathe. In your quest, you'll discover that more than your family's safety is at stake. The fate of the whole world rests on your wits and fins. Explore giant levels of solving puzzles and fighting denizens of the sea. Knife through the waters, flip above the waves, with motions created from real dolphins.", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Xanth Software F/X"], "id": 27367, "game_title": "Faceball 2000", "release_date": "1993-12-17", "platform": 20, "players": 2, "overview": "Faceball 2000 (フェイスボール２０００) is a Sega Game Gear game developed by Xanth Software as a sequel to the Atari ST game, Midi Maze. The game is notable for being a first person shooter - a genre that is typically said to be too processor intensive for systems such as the Game Gear.\r\n\r\nThe game has the player walk around a 3D maze and shoot at floating happy faces.\r\n\r\nThe Game Gear version of the game was only released in Japan.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Riverhill Software Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 27368, "game_title": "From TV Animation Slam Dunk: Shouri-e no Starting 5", "release_date": "1994-12-16", "platform": 20, "players": 2, "overview": "From TV Animation Slam Dunk: Shouri-e no Starting 5 (テレビアニメ スラムダンク 勝利へのスターティング５) is a simulation game developed by SIMS and published by Bandai for the Sega Game Gear. It is based on the 1993 Slam Dunk anime series.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Bandai Co., Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27369, "game_title": "Gamble Panic", "release_date": "1995-01-27", "platform": 20, "players": 1, "overview": "Gamble Panic (ぎゃんぶるぱにっく) is a gambling game for the Sega Game Gear.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Namco"], "id": 27370, "game_title": "Gear Stadium Heiseiban", "release_date": "1995-10-20", "platform": 20, "players": 2, "overview": "Gear Stadium Heiseiban (ギアスタジアム 平成版) is a baseball game for the Sega Game Gear. It is an updated version of Gear Stadium with a Nippon Professional Baseball license and the names of real NPB players.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Namco"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["M2"], "id": 27371, "game_title": "Gunstar Heroes", "release_date": "1995-03-24", "platform": 20, "players": 1, "overview": "The Gunstar 9 planet was peaceful for many years until the vicious dictator Colonel Red kidnapped the Gunstar twins' older brother and used mind control to make him his slave. Now, face many different enemies and bosses in Gunstar Heroes, as you battle to stop the dictator from unleashing \"Golden Silver the Destructor\" with apocalyptic consequences!", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Compile"], "id": 27372, "game_title": "GG Aleste", "release_date": "1991-12-20", "platform": 20, "players": 1, "overview": "GG Aleste (ＧＧアレスタ) is a game in Compile's Aleste series of shoot-'em-ups for the Sega Game Gear. It was only released in Japan and is one of the few Compile Game Gear games published by Compile rather than Sega.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Compile"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27373, "game_title": "Doraemon Nora no Suke no Yabou", "release_date": "1993-04-28", "platform": 20, "players": 1, "overview": "Doraemon Nora no Suke no Yabou (ドラえもん ノラのすけの野望) is an action game for the Sega Game Gear. It is based upon the 1979 Doraemon anime.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27374, "game_title": "Godzilla: Kaijuu no Daishingeki", "release_date": "1995-12-08", "platform": 20, "players": 1, "overview": "Godzilla: Kaijuu no Daishingeki is a turn based strategy game, with some arcade elements. A player can play as Godzilla or similar monsters (kaiju), like Anguirus, and Fire Rodan. Should players want to support humanity they can play as the G-Force, a human defense force. Humans have monster killing tools such as, tanks, artillery and planes. Some monsters are unplayable enemies and both sides will have the chance to fight against them.\r\n\r\nOn the map, the game is a typical war strategy. The player can move units on the map, and attack enemies. Battles have their own screen and animations. The fighting is quite arcade-like and simple, functioning similarly to fighting games. When all units have used their actions points a turn ends.\r\n\r\nGodzilla: Kaijuu no Daishingeki has four maps, and an extra secret level.", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["NCS Corporation"], "id": 27375, "game_title": "Head Buster", "release_date": "1991-03-15", "platform": 20, "players": 2, "overview": "Head Buster (ヘッドバスター?, Headbuster) is a Game Gear video game that involves robots fighting in combat sequences.\r\n\r\nThe object is to earn more gold by winning matches and spending that money on better weapons like rifles, missile launchers, and flamethrowers. Robots can be traded in for money (gold) if updating them is impossible. At the center of each starting point is a base (circle). Either the base must be destroyed or all the opponent's robots must be destroyed in order to clear the battlefield. There is a certain range to each weapon; opponents cannot be attacked if they are too close or too far away from the weapon's firing range.\r\n\r\nThere are ten different maps in the game. Each level has its own password. Players must deliver newspapers for a tiny stipend in order to resume competing after a loss.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Masaya"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Japan System Supply"], "id": 27376, "game_title": "House of Tarot", "release_date": "1991-01-26", "platform": 20, "players": 1, "overview": "Tarot no Yakata is a Miscellaneous game, developed by Japan System Supply and published by Sega, which was released in Japan in 1991.", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27377, "game_title": "Hyokkori Hyoutanjima: Hyoutanjima no Daikoukai", "release_date": "1992-05-22", "platform": 20, "players": 1, "overview": "Hyokkori Hyoutanjima: Hyoutanjima no Daikoukai (ひょっこりひょうたん島 ひょうたん島の大航海) is a 1992 action game by Sega for the Sega Game Gear tying into the Hyokkori Hyoutanjima Japanese puppet show.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["CRI"], "id": 27378, "game_title": "Puzzle & Action: Ichidant-R GG", "release_date": "1994-11-25", "platform": 20, "players": 2, "overview": "Puzzle & Action: Ichidant-R (イチダントアール) is the sequel to Puzzle & Action: Tant-R, and like its prequel is an arcade game released for Sega System C arcade hardware. The game later brought to Sega Mega Drive and Sega Game Gear, with the latter being renamed Puzzle & Action: Ichidant-R GG (イチダントア～ルＧＧ). So far the game has never been released outside of Japan (and South Korea).\r\n\r\nLike Tant-R, Ichidant-R is a series of timed minigames, represented in the graphical style seen in Bonanza Bros.. Ichidant-R was bundled with Quiz Rouka ni Tattenasai! in Sega Ages Rouka ni Ichidant-R for the Sega Saturn, and it was also bundled with Tant-R as part of volume 6 in the Sega Ages 2500 series for the PlayStation 2. It was also released for the Wii's Virtual Console service in 2007.\r\n\r\nOne final game in the Puzzle & Action series, Puzzle & Action: Treasure Hunt was released for Sega Titan Video arcade hardware in 1997.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 27379, "game_title": "J. League Soccer Dream Eleven", "release_date": "1995-11-24", "platform": 20, "players": 2, "overview": "J. League Soccer Dream Eleven (Ｊリーグサッカードリームイレブン) is a football game for the Sega Game Gear.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Minato Giken"], "id": 27380, "game_title": "Kaitou Saint Tail", "release_date": "1996-03-29", "platform": 20, "players": 2, "overview": "Kaitou Saint Tail (怪盗セイント・テール) is an action game for the Sega Game Gear. It is based upon the 1994 Kaitou Sait Tail anime series.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sadato Taneda"], "id": 27381, "game_title": "Kinetic Connection", "release_date": "1991-03-29", "platform": 20, "players": 1, "overview": "Kinetic Connection (キネティック コネクション) is a Sega Game Gear puzzle game released only in Japan. It appears to be part of a series of games by Sadato Taneda but the relationship is unknown. In the game, you must reconstruct a scrambled video loop by swapping and rotating tiles.\r\n\r\nThe game has numerous cameos from Opa-Opa of Fantasy Zone fame.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27382, "game_title": "Kuni Chan no Game Tengoku", "release_date": "1991-11-22", "platform": 20, "players": 2, "overview": "Kuni Chan no Game Tengoku (クニちゃんのゲーム天国) is a table game for the Sega Game Gear.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27383, "game_title": "Kuni Chan no Game Tengoku Part 2", "release_date": "1992-12-18", "platform": 20, "players": 2, "overview": "Kuni Chan no Game Tengoku Part 2 (クニちゃんのゲーム天国ＰＡＲＴ２) is a table game for the Sega Game Gear and sequel to Kuni Chan no Game Tengoku.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Compile"], "id": 27384, "game_title": "Madou Monogatari A: Doki Doki Vacation", "release_date": "1995-11-24", "platform": 20, "players": 1, "overview": "Madou Monogatari A: Doki Doki Vacation (魔導物語Ａ － ドキドキばけ～しょん) is a Sega Game Gear RPG released as part of Compile's Madou Monogatari series.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Compile"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Compile"], "id": 27385, "game_title": "Madou Monogatari I: 3tsu no Madoukyuu", "release_date": "1993-12-03", "platform": 20, "players": 1, "overview": "Madou Monogatari I: 3tsu no Madoukyuu (魔導物語Ｉ ~３つの魔導球~) is a role-playing game for the Sega Game Gear released as part of Compile's Madou Monogatari series, specifically in the first \"1-2-3\" entry. A different version of this game was released on the Mega Drive Madou Monogatari I.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Compile"], "id": 27386, "game_title": "Madou Monogatari II: Arle 16-Sai", "release_date": "1994-05-20", "platform": 20, "players": 2, "overview": "Madou Monogatari II: Arle 16-Sai (魔導物語ＩＩ ~アルル１６才~) is a Sega Game Gear sequel to Madou Monogatari I: 3tsu no Madoukyuu.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Compile"], "id": 27387, "game_title": "Madou Monogatari III: Kyuukyoku Joou-Sama", "release_date": "1994-12-30", "platform": 20, "players": 1, "overview": "Madou Monogatari III: Kyuukyoku Joou-sama (魔導物語ＩＩＩ ~究極女王様~) is a Sega Game Gear sequel to Madou Monogatari II: Arle 16-Sai.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27388, "game_title": "Magic Knight Rayearth", "release_date": "1994-12-16", "platform": 20, "players": 1, "overview": "Magic Knight Rayearth (魔法騎士レイアース) is a 1994 RPG by Sega for the Sega Game Gear tying into CLAMP's Magic Knight Rayearth manga. It was followed by Magic Knight Rayearth 2: Making of Magic Knight.\r\n\r\nThe game was packaged with a limited edition red Game Gear console, as well as sold separately.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27389, "game_title": "Magic Knight Rayearth 2: Making of Magic Knight", "release_date": "1995-08-04", "platform": 20, "players": 1, "overview": "Magic Knight Rayearth 2: Making of Magic Knight (魔法騎士レイアース２ ～making of magic knight～) is an RPG for the Sega Game Gear. It is based upon the Magic Knight Rayearth manga and anime series.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Namco"], "id": 27390, "game_title": "Mappy", "release_date": "1991-05-24", "platform": 20, "players": 2, "overview": "Mappy (マッピー) is an arcade game developed by Namco which was ported to the Sega Game Gear in 1991. It follows Mappy the police mouse retrieving stolen goods from a band of cats called mewkies. The Game Gear version of the game was only released in Japan.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Namco"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 27391, "game_title": "Megami Tensei Gaiden: Last Bible", "release_date": "1994-04-22", "platform": 20, "players": 1, "overview": "Megami Tensei Gaiden: Last Bible (女神転生外伝 ラストバイブル) is an RPG for the Sega Game Gear. It was followed by Megami Tensei Gaiden: Last Bible Special.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 27392, "game_title": "Megami Tensei Gaiden: Last Bible Special", "release_date": "1995-03-24", "platform": 20, "players": 1, "overview": "Megami Tensei Gaiden: Last Bible Special (女神転生外伝 ラストバイブル スペシャル) is an RPG for the Sega Game Gear.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tengen"], "id": 27393, "game_title": "Magical Puzzle Popils", "release_date": "1992-01-01", "platform": 20, "players": 1, "overview": "Magical Puzzle Popils (マジカルパズル・ポピルズ), known as Popils: The Blockbusting Challenge in Europe, is a puzzle game for the Sega Game Gear.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Tengen"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tsukuda Ideal"], "id": 27394, "game_title": "Magical * Taruruuto-kun", "release_date": "1991-07-05", "platform": 20, "players": 1, "overview": "Fifth grader Edojou Honmaru is one of the most trodden-upon losers in his class, until he meets Magical Taluluto-kun. Taluluto's powers help him deal with all his hardships, such as girls, bullies, and numerous other challenges.", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Tsukuda Ideal"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27395, "game_title": "Moldorian: Hikari to Yami no Shisutaa", "release_date": "1994-10-30", "platform": 20, "players": 1, "overview": "Moldorian is a Role-Playing game, published by Sega, which was released in Japan in 1994.", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Compile"], "id": 27396, "game_title": "Nazo Puyo", "release_date": "1993-07-27", "platform": 20, "players": 1, "overview": "Nazo Puyo (なぞぷよ) is a 1993 game for the Sega Game Gear by Compile spinning off Puyo Puyo. It was released exclusively in bundles with specially marked Game Gears in Japan (hence its price tag) and would go on to receive two sequels on the Game Gear (the latter receiving two sequels on the Super Nintendo Entertainment System) and many PC-98 games (one retail, the others as part of the DiscStation series) and would be retooled as the Puzzle Mode of the 8-bit version of Dr. Robotnik's Mean Bean Machine.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Compile"], "id": 27397, "game_title": "Nazu Puyo 2", "release_date": "1993-12-10", "platform": 20, "players": 1, "overview": "Nazo Puyo 2 is a Puzzle game, developed by Compile and published by Sega, which was released in Japan in 1993.", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Compile"], "id": 27398, "game_title": "Nazo Puyo Arle no Roux", "release_date": "1994-07-29", "platform": 20, "players": 1, "overview": "Nazo Puyo Arle no Roux (なぞぷよ アルルのルー; also mistakenly referred to as transliterations Nazo Puyo: Aruru no ruuu and Nazo Puyo: Aruru no Ru) is a puzzle game developed by Compile for the Sega Game Gear and released exclusively in Japan in 1994. Despite being the third game in the Nazo Puyo subseries, it is drastically different from its prequels, taking a combined RPG/puzzle approach to its (now existent) storyline. It would receive two sequels, both on the Super Nintendo Entertainment System (Super Nazo Puyo Rulue no Roux, combining a retooled version of this game with a new story mode focusing on Rulue, and Super Nazo Puyo Tsu: Rulue no Tetsuwan Hanjouki, a new game focusing exclusively on Rulue).", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": ["Nazo Puyo: Aruru no ruuu"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27399, "game_title": "Neko Dai Suki!", "release_date": "1996-07-19", "platform": 20, "players": 2, "overview": "Neko Dai Suki! (ねこ大好き！) is a virtual pet game for the Sega Game Gear.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Life Simulation"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27400, "game_title": "Ninku", "release_date": "1995-07-21", "platform": 20, "players": 1, "overview": "Ninku (忍空) is a Sega Game Gear action game based on the anime series of the same name.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": ["Ninkuu"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27401, "game_title": "Ninku 2: Tenkuuryuu e no Michi", "release_date": "1995-12-22", "platform": 20, "players": 1, "overview": "Ninku 2: Tenkuryu-e no Michi (忍空２ ～天空龍への道～) is a Sega Game Gear sequel to Ninku.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": ["Ninkuu 2: Tenkuuryuu-e no Michi"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27402, "game_title": "Ninku Gaiden: Hiroyuki Daikatsugeki", "release_date": "1995-11-03", "platform": 20, "players": 1, "overview": "Ninkuu Gaiden: Hiroyuki Daikatsugeki (忍空外伝 － ヒロユキ大活劇) is a Sega Game Gear top-down action game based on the Ninkuu franchise.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": ["Ninkuu Gaiden: Hiroyuki Daikatsugeki"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27403, "game_title": "Panzer Dragoon Mini", "release_date": "1996-11-22", "platform": 20, "players": 1, "overview": "One thousand years into the future, you live in constant fear of the Dark Dragon and his giant cyborg insect armies. Armed with a deadly weapon from the ancient past and the guidance of your armored blue dragon, you must save your people from endless swarms of deadly foes. Fulfill your destiny and keep the Dark Dragon from reaching the tower; or die trying.", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Tiertex Design Studios"], "id": 27404, "game_title": "Paperboy", "release_date": "1992-01-01", "platform": 20, "players": 1, "overview": "Ride your trusty bike - loaded with tightly rolled newspapers - through a comical, ever-changing neighborhood. Score big points by tossing papers into subscribers' mailboxes and porches. Don't miss, 'cause you'll lose a customer for every bad throw. Now, for the real fun: score even bigger points by bombarding nonsubscribers' homes, taking out their windows, lamps and statues! But watch out for bad drivers, skateboarders, remote control cars and lots of other obstacles. They can ruin your day real fast. After work, take on the Training Course, a BMX-style bonus round that'll test your aim and riding skills to the max!", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Tengen"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27405, "game_title": "Phantasy Star Adventure", "release_date": "1992-03-13", "platform": 20, "players": 1, "overview": "Phantasy Star Adventure (ファンタシースターアドベンチャー) is a Sega Game Gear released as part of the Phantasy Star franchise. It was only released in Japan.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Adventure"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Japan System Supply"], "id": 27406, "game_title": "Phantasy Star Gaiden", "release_date": "1992-10-16", "platform": 20, "players": 1, "overview": "Phantasy Star Gaiden (ファンタシースター外伝) is a Sega Game Gear released as part of the Phantasy Star franchise. It was only released in Japan.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Micro Cabin Co."], "id": 27407, "game_title": "Pop Breaker", "release_date": "1991-02-23", "platform": 20, "players": 2, "overview": "Pop Breaker (ポップブレイカー) is a shoot-'em-up game for the Sega Game Gear. It was only released in Japan.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Micro Cabin Co."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Technos Japan Corp."], "id": 27408, "game_title": "Popeye Beach Volleyball", "release_date": "1994-08-12", "platform": 20, "players": 2, "overview": "He's Popeye the Sailor, but he's not out at sea this time. Popeye and his friends have decided to take a break and enjoy the beach, but Brutus wants the attention of Olivia, and challenges Popeye to a game of Volleyball!", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Technos Japan Corp."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Compile"], "id": 27409, "game_title": "Puyo Puyo", "release_date": "1993-03-19", "platform": 20, "players": 2, "overview": "Puyo Puyo is a Puzzle game, developed by Compile and published by Sega, which was released in Japan in 1993.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": ["Puzlow Kids"]}, {"platform_name": "Sega Game Gear", "developers": ["Compile"], "id": 27410, "game_title": "Puyo Puyo Tsuu", "release_date": "1991-12-16", "platform": 20, "players": 2, "overview": "Puyo Puyo Tsuu (ぷよぷよ通), Tsuu being an English pun, as \"tsuu\" (通 tsū, meaning Expert) when spoken aloud sounds similar to the English word \"two\", is a puzzle game developed by Compile in 1994, initially released for Sega's System C-2 arcade board before being ported to other consoles (such as the Sega Mega Drive, Sega Game Gear, and Sega Saturn). It is the sequel to the Sega/Compile version of Puyo Puyo, whose path the entire series has followed to date.\r\n\r\nThe standalone game was exclusively released in Japan until 2000, when Sega ported it to the Neo Geo Pocket Color under the name Puyo Pop in the US/Europe (unrelated to the GBA Puyo Pop Minna de Puyo Puyo) — making it the first Puyo Puyo game to be released outside Japan unaltered (and establishing the Puyo Puyo/Puyo Pop naming discretion still used today). It was also included as the Classic mode of Puyo Pop Fever and later rereleased on the Virtual Console's Import section (albeit untranslated).\r\n\r\nSega also produced a port to Bandai's WonderSwan handheld.\r\n\r\nThe Mega Drive version was the first MD game to use the new Saturn-style box layout in the JP region.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": ["Puyo Puyo 2", "Puyo Puyo Tsu", "Puyo Puyo 2: Tsuu"]}, {"platform_name": "Sega Game Gear", "developers": ["Taito Corporation"], "id": 27411, "game_title": "Rastan Saga", "release_date": "1991-08-09", "platform": 20, "players": 1, "overview": "You are Rastan, an iron muscled barbarian from the cold northlands. A bounty hunter by trade, you fear no man or dark, slavering beast! For you are a master of every edged weapon. Now, a king has given you a quest. Rescue his daughter from the deepest reaches of Semia; a land where even villains fear to tread. Succeed, and wealth beyond your wildest dreams shall be the reward! Take destiny into your own hands. Journey into the darkest heart of Semia, using magical weapons, armor and potions you find and win on the way. At every turn you'll encounter nightmarish creatures determined to stop you. But beware... the king has sent over 100 men into Semia... and each has met his doom! Will you?", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Taito Corporation"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 27412, "game_title": "Royal Stone: Hirakareshi Toki no Tobira", "release_date": "1995-02-24", "platform": 20, "players": 1, "overview": "Royal Stone: Hirakareshi Toki no Tobira (ロイアル・ストーン ～開かれし時の扉～) is an RPG for the Sega Game Gear.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Bandai Co., Ltd."], "id": 27413, "game_title": "SD Gundam Winner's History", "release_date": "1995-03-24", "platform": 20, "players": 1, "overview": "SD Gundam Winner's History (ＳＤガンダム ウィナーズ ヒストリー) is a Sega Game Gear game based on the Gundam series.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Bandai Co., Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sunsoft"], "id": 27414, "game_title": "Shikinjoh", "release_date": "1991-04-26", "platform": 20, "players": 1, "overview": "Shikinjoh or Shi Kin Joh or Shi-Kin-Joh or Shikinjou (or likewise) (紫禁城) is a 1989/1990 puzzle game by Scap Trust for the NEC PC-88 and NEC PC-98. Sunsoft ported it to the Sega Mega Drive and Sega Game Gear in 1991, with the Mega Drive version having added Sega Mega Modem capabilities. No version has left Japan. A version was later included with Sunsoft's Game no Tetsujin The Shanghai for the Sega Saturn.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["SUNSOFT"], "alternates": ["Shi Kin Joh", "Shi-Kin-Joh", "Shikinjou"]}, {"platform_name": "Sega Game Gear", "developers": ["Sonic! Software Planning"], "id": 27415, "game_title": "Shining Force Gaiden: Ensei Jashin no Kuni e", "release_date": "1992-12-15", "platform": 20, "players": 1, "overview": "Shining Force Gaiden: Ensei Jashin no Kuni e (シャイニング・フォース外伝 ～遠征・邪神の国へ～) is a Sega Game Gear entry in the Shining series of games.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Role-Playing"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Thinking Rabbit"], "id": 27416, "game_title": "Soukoban", "release_date": "1990-12-15", "platform": 20, "players": 1, "overview": "Soukoban (倉庫番) is a puzzle game developed by Thinking Rabbit. Sega ported it to the SG-1000 in 1985, and in 1990, a Sega Game Gear version was also released. Neither version left Japan.\r\n\r\nSoukoban is the basis for Shove It! ...The Warehouse Game, released for the Sega Mega Drive.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Riverhill Software Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 27417, "game_title": "Tama & Friends: 3 Choume Kouen Tamalympic", "release_date": "1995-03-03", "platform": 20, "players": 1, "overview": "Tama & Friends: 3 Choume Kouen Tamalympic (タマ＆フレンズ ３丁目公園 タマリンピック) is an action game for the Sega Game Gear. It is based upon the 1994 Tama and Friends anime series.", "last_updated": "2018-07-17 03:58:29", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Infogrames"], "id": 27418, "game_title": "Tintin in Tibet", "release_date": "1995-01-01", "platform": 20, "players": 1, "overview": "Tintin in Tibet, distributed with localized names such as Tintin au Tibet in French, is a 1995 action game by Infogrames for various platforms, including the Sega Mega Drive and Sega Game Gear, tying into the Tintin in Tibet comic.", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Infogrames Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": null, "id": 27788, "game_title": "World Derby", "release_date": "1994-05-27", "platform": 20, "players": null, "overview": "A Japanese derby stallion racing game/betting simulator for the Game Gear handheld.", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": null, "publishers": null, "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Now Production Co."], "id": 27789, "game_title": "Wagyan Land", "release_date": "1991-07-26", "platform": 20, "players": 1, "overview": "Wagyan Land is an Action game, developed by Now Production and published by Namco, which was released in Japan in 1989.", "last_updated": "2018-07-11 21:05:35", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Namco"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["West One"], "id": 27906, "game_title": "Revenge of Drancon", "release_date": "1991-01-01", "platform": 20, "players": 1, "overview": "Your girlfriend... She's gone! Kidnapped by the notorious King Drancon.\r\nBut this is no ordinary rescue mission. Because King Drancon is no ordinary adversary.\r\nEnter the deepest of deep dark forests. And trek across the burning deserts of 10 different lands. Discover supplies that give you speed and strength. Then fend for yourself against nature's nastiest enemies - cobras, piranhas, bats, spiders and finally, King Drancon's lightning-speed fireballs.", "last_updated": "2018-07-06 22:32:55", "rating": null, "coop": "No", "youtube": null, "genres": ["Action", "Platform"], "publishers": ["Sega"], "alternates": ["Wonder Boy"]}, {"platform_name": "Sega Game Gear", "developers": ["Sun Electronics"], "id": 29402, "game_title": "Shanghai II", "release_date": "1990-12-27", "platform": 20, "players": 2, "overview": "Shanghai II (上海ＩＩ), not to be confused with Shanghai II: Dragon's Eye on the Sega Mega Drive, is a Sega Game Gear game. They are both sequels to Shanghai.", "last_updated": "2018-07-17 03:58:30", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["SUNSOFT"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Big Red Software"], "id": 29969, "game_title": "CJ Elephant Fugitive", "release_date": "1991-01-01", "platform": 20, "players": 2, "overview": "Accused of a crime he did not commit - CJ Elephant is imprisoned in a Zoo. Using advanced peanut propelling weaponry, an uncanny ability to find explosive charges and a handy umbrella he promptly escapes.\r\n\r\nNow he must flee London, push on to Paris, across the Alps and career through Cairo until he finally makes it home to Africa.", "last_updated": "2018-07-11 21:05:36", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Codemasters"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["System Vision"], "id": 31821, "game_title": "Car Licence", "release_date": null, "platform": 20, "players": null, "overview": "Car Licence (カーライセンス) is an educational Sega Game Gear game. It was developed to help users pass their driving test.", "last_updated": "2018-07-17 03:58:30", "rating": null, "coop": "No", "youtube": null, "genres": null, "publishers": ["Mitsubishi Electric"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["EA"], "id": 34727, "game_title": "Jungle Strike", "release_date": "1995-01-01", "platform": 20, "players": 1, "overview": "A boat armed with nuclear weapons blows up a remote Pacific island. The explosion was to demonstrate the ability of a terrorist arms dealer, Ibn Kilbaba. The son of the now-deceased terrorist from Desert Strike, who has teamed up with the notorious drug dealing fugitive Carlos Ortega. Whose capture cost many military lives. to take revenge on the US by blowing up Washington, DC. The original Special Forces helicopter team is now called to stop both men using the Super Comachine Attack Chopper.", "last_updated": "2018-07-11 21:05:37", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["EA Games"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["TahoeÂ SoftwareÂ Productions"], "id": 36429, "game_title": "Barbie Super Model", "release_date": null, "platform": 20, "players": null, "overview": "Barbie Super Model is an Action game, developed by Bonsai Entertainment Corp. and published by Hi Tech Expressions, which was cancelled before it was released.", "last_updated": "2018-07-11 21:05:38", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Hi-Tech Expressions, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Imagitec Design Inc."], "id": 36430, "game_title": "Championship Hockey", "release_date": "1994-01-01", "platform": 20, "players": null, "overview": "Compete in a super realistic ice hockey game with all the frantic action of Championship Hockey - skilful skating, thundering body checks and rifling slap shots. You'll have to skate well to avoid crunching body checks from defenders and out manoeuvre goalkeepers in your quest for The Cup!", "last_updated": "2018-07-11 21:05:38", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["U.S. Gold Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["The Kremlin"], "id": 36431, "game_title": "Crazy Faces", "release_date": null, "platform": 20, "players": 1, "overview": "Crazy Faces is a Puzzle game, developed by The Kremlin and published by Domark, which was cancelled before it was released.", "last_updated": "2018-07-11 21:05:38", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Domark Group Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Rage Software"], "id": 36432, "game_title": "Dr. Franken", "release_date": "1993-01-01", "platform": 20, "players": 1, "overview": "Dr. Franken is an action game developed for the Game Boy by Motivetime. Codemasters acquired a license to port the game to the Sega Mega Drive and Elite Systems were due to bring it to the Sega Game Gear, but neither version materialised.\r\n\r\nA \"demo\" build of the Game Gear version has since been leaked online.", "last_updated": "2018-07-11 21:05:38", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Codemasters"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Peakstar Software"], "id": 37038, "game_title": "F1 - World Championship Edition", "release_date": "1995-01-01", "platform": 20, "players": 1, "overview": "F1: World Championship Edition is the sequel to F1. It was released for the Sega Mega Drive and Sega Game Gear in 1995. It was only released in Europe and Australia. Sega Master System and Mega-CD versions were once planned.", "last_updated": "2018-07-11 21:05:38", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Domark Group Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Namco"], "id": 37039, "game_title": "Galaga 2", "release_date": "1991-01-01", "platform": 20, "players": 1, "overview": "Galaga 2 (Europe) or Galaga '91 (Japan) is a sequel to Namco's 1981 arcade classic, Galaga (brought to the SG-1000 as Sega-Galaga). It is actually a port of Galaga '88, originally released in arcades in 1988, retitled to reflect its Sega Game Gear release of 1991.\r\n\r\nGalaga '91 can cause confusion not just because of its arcade origins three years prior, but because in Europe, this Game Gear version was retitled (again) as Galaga 2, being marketed as a direct sequel to Galaga. It is, however, the fourth game in the series; being preceeded by the 1979 arcade game, Galaxian, Galaga in 1981 and finally Gaplus in 1984 (sometimes called Galaga 3 - an equally misleading title). To make matters worse, Namco released an arcade sequel called Galaxian³ (also known as Galaxian 3') in 1990, and the TurboGrafx-16 port of Galaga '88/'91 is called Galaga '90. More recent games have opted to avoid numbering systems and always use the Galaga name.\r\n\r\nGalaga '88/'91 builds on the gameplay seen in Galaxian, Galaga and Gaplus, the most notable addition being the inclusion of more detailed backgrounds (as opposed to coloured scrolling starfields). The Game Gear version was not released in North America.", "last_updated": "2018-07-11 21:05:38", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Namco"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Spidersoft"], "id": 37040, "game_title": "Lemmings 2 - The Tribes", "release_date": "1994-01-01", "platform": 20, "players": 1, "overview": "Lemmings 2: The Tribes is a sequel to Lemmings, and was released, among other consoles, for the Sega Mega Drive in 1994.\r\n\r\nGameplay is much the same as in its prequel, however now Lemmings are split into \"tribes\", each with their own special skills. There are over 120 levels and 60 different skills.\r\n\r\nSega Master System and Sega Game Gear versions were reportedly completed (and even reviewed), but never released. In 2014, the main programmer Matt Taylor released them both in the SMS Power! community boards.", "last_updated": "2018-07-11 21:05:33", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Psygnosis Limited"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Kalisto Entertainment"], "id": 37041, "game_title": "Pac-In-Time", "release_date": "1994-01-01", "platform": 20, "players": 1, "overview": "Pac-In-Time (Prototype for Sega Game Gear) is a video game developed by Kalisto and published by Namco, featuring the popular arcade character Pac-Man. It was released in 1994 for MS-DOS, Macintosh, Super NES and Game Boy. It was released shortly after Pac-Man 2: The New Adventures, which brought about the change from the classic arcade versions of Pac-Man to the development of more complex and adventurous games.\r\n\r\nThis game was an offshoot from the normal variety of Pac-Man games, in that it does not confine Pac-Man to a maze-like board. Rather, the player controls Pac-Man through various side-scrolling levels, obtaining many different items along the way; the plot does take elements from the earlier Pac-Man games, such as the objective to collect a certain number of pellets before exiting a level. The game allows the player to access completed levels via passwords that are given every five levels.\r\n\r\nThe game is a rebranded version of a 1993 game, Fury of the Furries, also developed by Kalisto. The PC, Macintosh and Game Boy versions are almost identical to the original, while the Super NES game, despite using the same basic gameplay mechanics, is an entirely new game using a different game engine and aesthetic.\r\n\r\nVersions of Pac-In-Time were planned for the Genesis and Game Gear were planned, but canceled. A ROM image of the Game Gear version has since surfaced online.", "last_updated": "2018-07-11 21:05:38", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Namco"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Infogrames"], "id": 37043, "game_title": "The Smurfs Travel the World", "release_date": "1996-01-01", "platform": 20, "players": 1, "overview": "The Smurfs Travel the World (Les Schtroumpfs Autour du Monde) or The Smurfs 2 (Les Schtroumpfs 2) is the sequel to The Smurfs. It was released for the Sega Mega Drive, Sega Master System and Sega Game Gear in 1996.", "last_updated": "2018-07-11 21:05:38", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Infogrames Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Infogrames"], "id": 37044, "game_title": "Spirou", "release_date": "1996-01-01", "platform": 20, "players": 1, "overview": "Spirou (Prototype for Sega Game Gear) is a platform game developed and published by Infogrames Entertainment during 1995 and 1996 for the Sega Mega Drive, SNES and Game Boy video game consoles, as well as Windows and DOS. A Sega Game Gear version was planned, but ultimately scrapped, though a prototype version was leaked online.\r\n\r\nThe game is based on the Spirou et Fantasio comic book series. It features the adventure of Spirou trying to save his kidnapped friend Count Champignac and stop his arch-enemy Cyanida from making robots rule the earth. The game was noted for its good graphics and for being faithful to Spirou et Fantasio the comic book series, but due to the relatively high difficulty, most reviewers only recommended the game for true fans of the comic book series.", "last_updated": "2018-07-11 21:05:38", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Infogrames Entertainment"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Daou Infosys Corp."], "id": 37045, "game_title": "Street Hero", "release_date": "1993-01-01", "platform": 20, "players": 1, "overview": "Street Hero is a Streets of Rage style side scrolling beat-em-up, offering plenty of action for Sega's handheld. Although the Sega Master System version of the game saw release in Korea, it is one considerable rarity that very few have actually seen. This fact is only strengthened by the knowledge that until February 2012, no ROM of the game existed online in any form. A real shame given the high level of quality of gameplay which has come from the usually disappointing array of 8-bit Korean developers.", "last_updated": "2018-07-11 21:05:38", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["Innovation Tech"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Leadfilm"], "id": 37046, "game_title": "WildSnake", "release_date": "1994-01-01", "platform": 20, "players": 1, "overview": "WildSnake is a puzzle game released for the Super Nintendo Entertainment System and Game Boy in 1994.\r\n\r\nBoth Sega Mega Drive and Sega Game Gear versions of WildSnake were advertised for release, but both were cancelled for unknown reasons. Prototypes of both have since surfaced.\r\n\r\nAdvertising saw Tetris creator Alexey Pajitnov lend his name to the game, however Pajitnov was not involved in its development.", "last_updated": "2018-07-11 21:05:38", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Spectrum Holobyte, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Entertainment Int"], "id": 37048, "game_title": "Yogi Bear in Yogi Bear's Goldrush", "release_date": "1994-10-01", "platform": 20, "players": 1, "overview": "Yogi Bear has to save Jellystone National Park from an evil ghost named Jake; who stole the funds needed to keep the park operating. There are six different stages in the game that range from a large city to the Wild West. There are no-powerups in the traditional sense; players must collect 100 picnic baskets for an extra life.  Hidden doors and areas must be found in order to crack open the safes.  Once inside a safe, Yogi must collect 25 gold coins to make a bar.  In order to unlock the best ending, Yogi needs to convert 300 gold coins into 12 gold bars that will provide the park with the money to continue operations.\r\n\r\nThe player has the ability to jump on most enemies to kill them, just like in Super Mario Bros..Some enemies must be left alone due to the lack of ability to wield a weapon.  Falling down into bottomless pits or navigating into dangerous hazards will cause Yogi to lose a life.  By default, the player gets three lives and one additional continue.", "last_updated": "2018-07-11 21:05:38", "rating": "E - Everyone", "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["GameTek, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Teque London"], "id": 37361, "game_title": "F1", "release_date": "1993-06-01", "platform": 20, "players": 2, "overview": "F1 is an Official Formula One Racing Game. It's also the fastest, most authentic, most thrilling Game Gear racing game yet. Battle it out on the real Formula One Circuits against the real teams and the real drivers of the FIA Formula One World Championship.", "last_updated": "2018-07-11 21:05:38", "rating": null, "coop": "No", "youtube": null, "genres": ["Racing"], "publishers": ["Domark Group Ltd."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Open Corp"], "id": 37489, "game_title": "Jang Pung II", "release_date": null, "platform": 20, "players": 2, "overview": "Jang Pung II is an unlicensed fighting game released in South Korea for the Sega Master System and Sega Game Gear. It is effectively a port of Capcom's Street Fighter II (so much so that is sometimes labeled as Street Fighter or Street Fighter II, particularly when sold outside of South Korea), but with different background graphics and occasionally altered character names. It has also been spotted under the name Street Blaster.", "last_updated": "2018-07-11 22:07:28", "rating": null, "coop": "No", "youtube": null, "genres": ["Fighting"], "publishers": ["Sieco"], "alternates": ["Street Fighter II", "Street Blaster", "장풍 II"]}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 41381, "game_title": "Hyper Chou Pro Yakyuu '92", "release_date": "1992-04-24", "platform": 20, "players": null, "overview": "Hyper Pro Yakyuu '92 is a Sports game, developed and published by Sega, which was released in Japan in 1992.", "last_updated": "2018-07-11 21:05:39", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 41669, "game_title": "Pet Club: Inu Dai Suki!", "release_date": "1996-12-06", "platform": 20, "players": null, "overview": "Pet Club: Inu Dai Suki! is a Strategy game, developed and published by Sega, which was released in Japan in 1996.", "last_updated": "2018-07-11 21:05:39", "rating": null, "coop": "No", "youtube": null, "genres": ["Life Simulation"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 41670, "game_title": "Inu Dai Suki!", "release_date": "1996-12-06", "platform": 20, "players": null, "overview": "Pet Club: Inu Dai Suki! is a Strategy game, developed and published by Sega, which was released in Japan in 1996.", "last_updated": "2018-07-11 21:05:39", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Namco"], "id": 41672, "game_title": "Pocket Jansou", "release_date": "1992-02-07", "platform": 20, "players": null, "overview": "Pocket Jansou is a Miscellaneous game, developed and published by Namco, which was released in Japan in 1992.", "last_updated": "2018-07-11 21:05:39", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Namco"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 41673, "game_title": "GG Portrait: Pai Chan", "release_date": "1996-11-22", "platform": 20, "players": null, "overview": "GG Portrait: Pai Chan is a Miscellaneous game, developed and published by Sega, which was released in Japan in 1996.", "last_updated": "2018-07-11 21:05:39", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Minato Giken"], "id": 41674, "game_title": "The Quiz Gear Fight!!", "release_date": "1995-04-07", "platform": 20, "players": null, "overview": "The Quiz Gear Fight!! is a Miscellaneous game, developed by Minato Giken and published by Sega, which was released in Japan in 1995.", "last_updated": "2018-07-11 21:05:39", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Archer MacLean"], "id": 43553, "game_title": "Drop Zone", "release_date": null, "platform": 20, "players": null, "overview": "Dropzone is a shoot 'em up video game developed by Archer Maclean and published in 1984 by U.S. Gold.", "last_updated": "2018-07-11 21:05:40", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Arena Graphics"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Martin Konrad"], "id": 43554, "game_title": "GG Nibbles", "release_date": null, "platform": 20, "players": null, "overview": "Snake-like game for the Game Gear.", "last_updated": "2018-07-11 21:05:40", "rating": null, "coop": "No", "youtube": null, "genres": null, "publishers": null, "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Game Arts"], "id": 45089, "game_title": "Gambler Jiko Chuushinha", "release_date": "1992-06-12", "platform": 20, "players": null, "overview": "Gambler Jiko Chuushinha is a mahjong gambling game based on a manga with the same name. As such, it has a large cast of characters from the comics that the player can choose to compete against. Beyond the manga license, it is very much still a mahjong game, focusing mostly on playing the tile-based board game, though using a difficult variation on the usual rules of the game.", "last_updated": "2018-07-11 21:05:41", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 45090, "game_title": "GG Portrait: Akira Yuki", "release_date": "1996-11-01", "platform": 20, "players": null, "overview": "GG Portrait: Akira Yuki is a Miscellaneous game, developed and published by Sega, which was released in Japan in 1996.", "last_updated": "2018-07-11 21:05:41", "rating": null, "coop": "No", "youtube": null, "genres": ["Life Simulation"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 45091, "game_title": "Honoo no Doukyuuji: Dodge Danpei", "release_date": "1992-08-07", "platform": 20, "players": null, "overview": "Honoo no Doukyuuji: Dodge Danpei is a dodgeball game that is based on a shounen serialized manga about a highschool dodgeball team. It was released on a number of consoles in 1992, each of which has its own variations.\r\n\r\nThe game plays similarly to other \"action\" dodgeball games such as Technos' Super Dodgeball, though the game presents various modes based on story beats. For instance, the game starts with a one-on-one duel in which each combatant has five hits before they're out.", "last_updated": "2018-07-11 21:05:41", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 45092, "game_title": "The Pro Yakyuu '91", "release_date": "1991-01-26", "platform": 20, "players": null, "overview": "The Pro Yakyuu '91 is a Sports game, developed and published by Sega, which was released in Japan in 1991.", "last_updated": "2018-07-11 21:05:41", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 45093, "game_title": "Pro Yakyuu GG League '94", "release_date": "1994-09-30", "platform": 20, "players": null, "overview": "Pro Yakyuu GG League '94 is a Sports game, developed and published by Sega, which was released in Japan in 1994.", "last_updated": "2018-07-11 21:05:41", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sunsoft"], "id": 45094, "game_title": "Shikinjou", "release_date": "1991-04-26", "platform": 20, "players": null, "overview": "Shikinjou is a Puzzle game, developed and published by SunSoft, which was released in Japan in 1991.", "last_updated": "2018-07-11 21:05:41", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["SUNSOFT"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Arc System Works Co., Ltd."], "id": 45095, "game_title": "Taisen Mahjong Haopai", "release_date": "1990-11-10", "platform": 20, "players": null, "overview": "Taisen Mahjong Haopai is a Miscellaneous game, developed by Arc System Works and published by Sega, which was released in Japan in 1990.", "last_updated": "2018-07-11 21:05:41", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Arc System Works Co., Ltd."], "id": 45096, "game_title": "Taisen Mahjong Haopai 2", "release_date": "1993-12-17", "platform": 20, "players": null, "overview": "Taisen Mahjong Haopai 2 is a Miscellaneous game, developed by Arc System Works and published by Sega, which was released in Japan in 1993.", "last_updated": "2018-07-11 21:05:41", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SystemSoft Alpha"], "id": 45097, "game_title": "Daisenryaku G", "release_date": "1991-09-28", "platform": 20, "players": null, "overview": "Daisenryaku G is a Strategy game, developed and published by SystemSoft, which was released in Japan in 1991.", "last_updated": "2018-07-11 21:05:41", "rating": null, "coop": "No", "youtube": null, "genres": ["Strategy"], "publishers": ["SystemSoft"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["CRI"], "id": 45098, "game_title": "Puzzle & Action: Tant-R GG", "release_date": "1994-04-22", "platform": 20, "players": null, "overview": "Puzzle & Action: Tant-R is a Miscellaneous game, developed by CRI and published by Sega, which was released in Japan in 1994.", "last_updated": "2018-07-11 21:05:41", "rating": null, "coop": "No", "youtube": null, "genres": ["Action"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 45099, "game_title": "Torarete Tamaruka!?", "release_date": "1994-06-03", "platform": 20, "players": null, "overview": "Torarete Tamaruka!? is an Action game, developed and published by Sega, which was released in Japan in 1994.", "last_updated": "2018-07-11 21:05:41", "rating": null, "coop": "No", "youtube": null, "genres": null, "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Aspect Co. Ltd."], "id": 52388, "game_title": "Sonic & Tails 2", "release_date": "1994-11-11", "platform": 20, "players": 1, "overview": "While Doctor Robotnik was testing his last weapon of destruction, one of his assistants made a grave mistake, resulting in five of the Chaos Emeralds spreading throughout Mobius. Sonic and Tails have to get the five Emeralds of Chaos before Doctor Robotnik, but this is not only his rival: Nack the Weasel (also known as Fang the Sniper) does not seem to be an ally of the hedgehog and the fox, like Knuckles , tricked by Robotnik.", "last_updated": "2018-07-06 22:32:55", "rating": "EC - Early Childhood", "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": ["Sega"], "alternates": ["Sonic Triple Trouble"]}, {"platform_name": "Sega Game Gear", "developers": ["Hudson Entertainment, Inc."], "id": 54901, "game_title": "Super Momotarou Dentetsu III", "release_date": "1995-12-15", "platform": 20, "players": 2, "overview": "Super Momotarou Dentetsu III  is a Sega Game Gear game released in Japan only.", "last_updated": "2018-07-11 21:05:44", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle"], "publishers": ["Hudson Entertainment, Inc."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Innovation Tech"], "id": 54907, "game_title": "Toto World 3", "release_date": null, "platform": 20, "players": null, "overview": "Toto World 3, aka ' Cave Dude ', is an unreleased prototype Innovation Tech tried to get released on the Game Gear in the US.\r\n\r\nAlthough not the most graphically impressive game compared to the likes of Sonic the Hedgehog, Cave Dude is a rather enjoyable platformer that will keep you coming back for more. It has a nice soundtrack, easy to pick up and play and what I really like is the character references in the game that remind me of some of those Arcade classics such as Toki and New Zealand Story. So if you want to have a play it's freely available and works on a Sega Master System and through emulation.", "last_updated": "2018-07-11 21:05:44", "rating": null, "coop": "No", "youtube": null, "genres": ["Platform"], "publishers": null, "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Micro Cabin Co."], "id": 54908, "game_title": "Fray: Shugyouhen", "release_date": "1991-12-27", "platform": 20, "players": 1, "overview": "Fray: Shugyouhen is an unusual slow vertical shooter with few platformer elements.  It is part of Micro Cabin's \"Xak\" series of games", "last_updated": "2018-07-11 21:05:44", "rating": null, "coop": "No", "youtube": null, "genres": ["Shooter"], "publishers": ["Micro Cabin Corp."], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["ITL"], "id": 54909, "game_title": "Tatakae! Pro Yakyuu Twin League", "release_date": "1995-07-14", "platform": 20, "players": 1, "overview": "Tatakae! Pro Yakyuu Twin League is a Sports game, developed by ITL and published by Sega, which was released in Japan in 1995.", "last_updated": "2018-07-11 21:05:44", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["SIMS Co., Ltd."], "id": 54910, "game_title": "J.League GG Pro Striker '94", "release_date": "1994-07-22", "platform": 20, "players": 1, "overview": "J.League GG Pro Striker '94 is a Sports game, developed by SIMS and published by Sega, which was released in Japan in 1994.", "last_updated": "2018-07-11 21:05:44", "rating": null, "coop": "No", "youtube": null, "genres": ["Sports"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Adrenalin Entertainment"], "id": 54911, "game_title": "Sports Trivia", "release_date": "1995-04-20", "platform": 20, "players": 1, "overview": "Sports Trivia is a Sega Game Gear sports quiz game released exclusively in North America. This particular version of the game is not fully understood - it is thought to have only been distributed as a pack-in with Game Gear consoles. A separate, updated(?) version exists in the form of Sports Trivia: Championship Edition.", "last_updated": "2018-07-11 21:05:44", "rating": null, "coop": "No", "youtube": null, "genres": ["Puzzle", "Strategy"], "publishers": ["Sega"], "alternates": null}, {"platform_name": "Sega Game Gear", "developers": null, "id": 55224, "game_title": "Taisen-gata", "release_date": null, "platform": 20, "players": null, "overview": null, "last_updated": "2018-07-11 21:05:44", "rating": null, "coop": null, "youtube": null, "genres": null, "publishers": null, "alternates": null}, {"platform_name": "Sega Game Gear", "developers": ["Sega"], "id": 61382, "game_title": "Aa Harimanada", "release_date": "1993-07-02", "platform": 20, "players": 1, "overview": "Aa Harimanada (ああ播磨灘) is a 1993 sumo wrestling game by Sega for the Sega Game Gear and Sega Mega Drive made to tie into TV Tokyo's Aa Harimanada anime.\r\n\r\nThe game is a typical fighting game with various button combinations doing something different. The Mega Drive version has a password system and a two-player versus mode.", "last_updated": "2018-10-29 15:28:48", "rating": "Not Rated", "coop": "No", "youtube": "", "genres": ["Fighting"], "publishers": ["Sega"], "alternates": null}]